MikroElektronika/core_packages/PIC/XC8/def/PIC18F6585/mcu.h
extern volatile CANSTAT_RO5bits_t CANSTAT_RO5bits __at(0xE6E);
// bitfield macros
#define _CANSTAT_RO5_EICODE0_POSN                           0x0
#define _CANSTAT_RO5_EICODE0_POSITION                       0x0
#define _CANSTAT_RO5_EICODE0_SIZE                           0x1
#define _CANSTAT_RO5_EICODE0_LENGTH                         0x1
#define _CANSTAT_RO5_EICODE0_MASK                           0x1
#define _CANSTAT_RO5_EICODE1_ICODE0_POSN                    0x1
#define _CANSTAT_RO5_EICODE1_ICODE0_POSITION                0x1
#define _CANSTAT_RO5_EICODE1_ICODE0_SIZE                    0x1
#define _CANSTAT_RO5_EICODE1_ICODE0_LENGTH                  0x1
#define _CANSTAT_RO5_EICODE1_ICODE0_MASK                    0x2
#define _CANSTAT_RO5_EICODE2_ICODE1_POSN                    0x2
#define _CANSTAT_RO5_EICODE2_ICODE1_POSITION                0x2
#define _CANSTAT_RO5_EICODE2_ICODE1_SIZE                    0x1
#define _CANSTAT_RO5_EICODE2_ICODE1_LENGTH                  0x1
#define _CANSTAT_RO5_EICODE2_ICODE1_MASK                    0x4
#define _CANSTAT_RO5_EICODE3_ICODE2_POSN                    0x3
#define _CANSTAT_RO5_EICODE3_ICODE2_POSITION                0x3
#define _CANSTAT_RO5_EICODE3_ICODE2_SIZE                    0x1
#define _CANSTAT_RO5_EICODE3_ICODE2_LENGTH                  0x1
#define _CANSTAT_RO5_EICODE3_ICODE2_MASK                    0x8
#define _CANSTAT_RO5_EICODE4_POSN                           0x4
#define _CANSTAT_RO5_EICODE4_POSITION                       0x4
#define _CANSTAT_RO5_EICODE4_SIZE                           0x1
#define _CANSTAT_RO5_EICODE4_LENGTH                         0x1
#define _CANSTAT_RO5_EICODE4_MASK                           0x10
#define _CANSTAT_RO5_OPMODE0_POSN                           0x5
#define _CANSTAT_RO5_OPMODE0_POSITION                       0x5
#define _CANSTAT_RO5_OPMODE0_SIZE                           0x1
#define _CANSTAT_RO5_OPMODE0_LENGTH                         0x1
#define _CANSTAT_RO5_OPMODE0_MASK                           0x20
#define _CANSTAT_RO5_OPMODE1_POSN                           0x6
#define _CANSTAT_RO5_OPMODE1_POSITION                       0x6
#define _CANSTAT_RO5_OPMODE1_SIZE                           0x1
#define _CANSTAT_RO5_OPMODE1_LENGTH                         0x1
#define _CANSTAT_RO5_OPMODE1_MASK                           0x40
#define _CANSTAT_RO5_OPMODE2_POSN                           0x7
#define _CANSTAT_RO5_OPMODE2_POSITION                       0x7
#define _CANSTAT_RO5_OPMODE2_SIZE                           0x1
#define _CANSTAT_RO5_OPMODE2_LENGTH                         0x1
#define _CANSTAT_RO5_OPMODE2_MASK                           0x80

// Register: CANCON_RO5
#define CANCON_RO5 CANCON_RO5
extern volatile unsigned char           CANCON_RO5          __at(0xE6F);
#ifndef _LIB_BUILD
asm("CANCON_RO5 equ 0E6Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FP0                    :1;
        unsigned WIN0_FP1               :1;
        unsigned WIN1_FP2               :1;
        unsigned WIN2_FP3               :1;
        unsigned ABAT                   :1;
        unsigned REQOP0                 :1;
        unsigned REQOP1                 :1;
        unsigned REQOP2                 :1;
    };
} CANCON_RO5bits_t;
extern volatile CANCON_RO5bits_t CANCON_RO5bits __at(0xE6F);
// bitfield macros
#define _CANCON_RO5_FP0_POSN                                0x0
#define _CANCON_RO5_FP0_POSITION                            0x0
#define _CANCON_RO5_FP0_SIZE                                0x1
#define _CANCON_RO5_FP0_LENGTH                              0x1
#define _CANCON_RO5_FP0_MASK                                0x1
#define _CANCON_RO5_WIN0_FP1_POSN                           0x1
#define _CANCON_RO5_WIN0_FP1_POSITION                       0x1
#define _CANCON_RO5_WIN0_FP1_SIZE                           0x1
#define _CANCON_RO5_WIN0_FP1_LENGTH                         0x1
#define _CANCON_RO5_WIN0_FP1_MASK                           0x2
#define _CANCON_RO5_WIN1_FP2_POSN                           0x2
#define _CANCON_RO5_WIN1_FP2_POSITION                       0x2
#define _CANCON_RO5_WIN1_FP2_SIZE                           0x1
#define _CANCON_RO5_WIN1_FP2_LENGTH                         0x1
#define _CANCON_RO5_WIN1_FP2_MASK                           0x4
#define _CANCON_RO5_WIN2_FP3_POSN                           0x3
#define _CANCON_RO5_WIN2_FP3_POSITION                       0x3
#define _CANCON_RO5_WIN2_FP3_SIZE                           0x1
#define _CANCON_RO5_WIN2_FP3_LENGTH                         0x1
#define _CANCON_RO5_WIN2_FP3_MASK                           0x8
#define _CANCON_RO5_ABAT_POSN                               0x4
#define _CANCON_RO5_ABAT_POSITION                           0x4
#define _CANCON_RO5_ABAT_SIZE                               0x1
#define _CANCON_RO5_ABAT_LENGTH                             0x1
#define _CANCON_RO5_ABAT_MASK                               0x10
#define _CANCON_RO5_REQOP0_POSN                             0x5
#define _CANCON_RO5_REQOP0_POSITION                         0x5
#define _CANCON_RO5_REQOP0_SIZE                             0x1
#define _CANCON_RO5_REQOP0_LENGTH                           0x1
#define _CANCON_RO5_REQOP0_MASK                             0x20
#define _CANCON_RO5_REQOP1_POSN                             0x6
#define _CANCON_RO5_REQOP1_POSITION                         0x6
#define _CANCON_RO5_REQOP1_SIZE                             0x1
#define _CANCON_RO5_REQOP1_LENGTH                           0x1
#define _CANCON_RO5_REQOP1_MASK                             0x40
#define _CANCON_RO5_REQOP2_POSN                             0x7
#define _CANCON_RO5_REQOP2_POSITION                         0x7
#define _CANCON_RO5_REQOP2_SIZE                             0x1
#define _CANCON_RO5_REQOP2_LENGTH                           0x1
#define _CANCON_RO5_REQOP2_MASK                             0x80

// Register: B5CON
#define B5CON B5CON
extern volatile unsigned char           B5CON               __at(0xE70);
#ifndef _LIB_BUILD
asm("B5CON equ 0E70h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FILHIT0_TXPRI0         :1;
        unsigned FILHIT1_TXPRI1         :1;
        unsigned FILHIT2_RTREN          :1;
        unsigned FILHIT3_TXREQ          :1;
        unsigned FILHIT4_TXERR          :1;
        unsigned RTRRO_TXLARB           :1;
        unsigned RXM1_TXABT             :1;
        unsigned RXFUL_TXBIF            :1;
    };
    struct {
        unsigned FILHIT0                :1;
        unsigned FILHIT1                :1;
        unsigned FILHIT2                :1;
        unsigned FILHIT3                :1;
        unsigned FILHIT4                :1;
        unsigned RTRRO                  :1;
        unsigned RXM1                   :1;
        unsigned RXFUL                  :1;
    };
    struct {
        unsigned TXPRI0                 :1;
        unsigned TXPRI1                 :1;
        unsigned RTREN                  :1;
        unsigned TXREQ                  :1;
        unsigned TXERR                  :1;
        unsigned TXLARB                 :1;
        unsigned TXABT                  :1;
        unsigned TXBIF                  :1;
    };
    struct {
        unsigned B5FILHIT0              :1;
        unsigned B5FILHIT1              :1;
        unsigned B5FILHIT2              :1;
        unsigned B5FILHIT3              :1;
        unsigned B5FILHIT4              :1;
        unsigned B5RTRRO                :1;
        unsigned B5RXM1                 :1;
        unsigned B5RXFUL                :1;
    };
    struct {
        unsigned B5TXPRI0               :1;
        unsigned B5TXPRI1               :1;
        unsigned B5RTREN                :1;
        unsigned B5TXREQ                :1;
        unsigned B5TXERR                :1;
        unsigned B5TXLARB               :1;
        unsigned B5TXABT                :1;
        unsigned B5TXBIF                :1;
    };
} B5CONbits_t;
extern volatile B5CONbits_t B5CONbits __at(0xE70);
// bitfield macros
#define _B5CON_FILHIT0_TXPRI0_POSN                          0x0
#define _B5CON_FILHIT0_TXPRI0_POSITION                      0x0
#define _B5CON_FILHIT0_TXPRI0_SIZE                          0x1
#define _B5CON_FILHIT0_TXPRI0_LENGTH                        0x1
#define _B5CON_FILHIT0_TXPRI0_MASK                          0x1
#define _B5CON_FILHIT1_TXPRI1_POSN                          0x1
#define _B5CON_FILHIT1_TXPRI1_POSITION                      0x1
#define _B5CON_FILHIT1_TXPRI1_SIZE                          0x1
#define _B5CON_FILHIT1_TXPRI1_LENGTH                        0x1
#define _B5CON_FILHIT1_TXPRI1_MASK                          0x2
#define _B5CON_FILHIT2_RTREN_POSN                           0x2
#define _B5CON_FILHIT2_RTREN_POSITION                       0x2
#define _B5CON_FILHIT2_RTREN_SIZE                           0x1
#define _B5CON_FILHIT2_RTREN_LENGTH                         0x1
#define _B5CON_FILHIT2_RTREN_MASK                           0x4
#define _B5CON_FILHIT3_TXREQ_POSN                           0x3
#define _B5CON_FILHIT3_TXREQ_POSITION                       0x3
#define _B5CON_FILHIT3_TXREQ_SIZE                           0x1
#define _B5CON_FILHIT3_TXREQ_LENGTH                         0x1
#define _B5CON_FILHIT3_TXREQ_MASK                           0x8
#define _B5CON_FILHIT4_TXERR_POSN                           0x4
#define _B5CON_FILHIT4_TXERR_POSITION                       0x4
#define _B5CON_FILHIT4_TXERR_SIZE                           0x1
#define _B5CON_FILHIT4_TXERR_LENGTH                         0x1
#define _B5CON_FILHIT4_TXERR_MASK                           0x10
#define _B5CON_RTRRO_TXLARB_POSN                            0x5
#define _B5CON_RTRRO_TXLARB_POSITION                        0x5
#define _B5CON_RTRRO_TXLARB_SIZE                            0x1
#define _B5CON_RTRRO_TXLARB_LENGTH                          0x1
#define _B5CON_RTRRO_TXLARB_MASK                            0x20
#define _B5CON_RXM1_TXABT_POSN                              0x6
#define _B5CON_RXM1_TXABT_POSITION                          0x6
#define _B5CON_RXM1_TXABT_SIZE                              0x1
#define _B5CON_RXM1_TXABT_LENGTH                            0x1
#define _B5CON_RXM1_TXABT_MASK                              0x40
#define _B5CON_RXFUL_TXBIF_POSN                             0x7
#define _B5CON_RXFUL_TXBIF_POSITION                         0x7
#define _B5CON_RXFUL_TXBIF_SIZE                             0x1
#define _B5CON_RXFUL_TXBIF_LENGTH                           0x1
#define _B5CON_RXFUL_TXBIF_MASK                             0x80
#define _B5CON_FILHIT0_POSN                                 0x0
#define _B5CON_FILHIT0_POSITION                             0x0
#define _B5CON_FILHIT0_SIZE                                 0x1
#define _B5CON_FILHIT0_LENGTH                               0x1
#define _B5CON_FILHIT0_MASK                                 0x1
#define _B5CON_FILHIT1_POSN                                 0x1
#define _B5CON_FILHIT1_POSITION                             0x1
#define _B5CON_FILHIT1_SIZE                                 0x1
#define _B5CON_FILHIT1_LENGTH                               0x1
#define _B5CON_FILHIT1_MASK                                 0x2
#define _B5CON_FILHIT2_POSN                                 0x2
#define _B5CON_FILHIT2_POSITION                             0x2
#define _B5CON_FILHIT2_SIZE                                 0x1
#define _B5CON_FILHIT2_LENGTH                               0x1
#define _B5CON_FILHIT2_MASK                                 0x4
#define _B5CON_FILHIT3_POSN                                 0x3
#define _B5CON_FILHIT3_POSITION                             0x3
#define _B5CON_FILHIT3_SIZE                                 0x1
#define _B5CON_FILHIT3_LENGTH                               0x1
#define _B5CON_FILHIT3_MASK                                 0x8
#define _B5CON_FILHIT4_POSN                                 0x4
#define _B5CON_FILHIT4_POSITION                             0x4
#define _B5CON_FILHIT4_SIZE                                 0x1
#define _B5CON_FILHIT4_LENGTH                               0x1
#define _B5CON_FILHIT4_MASK                                 0x10
#define _B5CON_RTRRO_POSN                                   0x5
#define _B5CON_RTRRO_POSITION                               0x5
#define _B5CON_RTRRO_SIZE                                   0x1
#define _B5CON_RTRRO_LENGTH                                 0x1
#define _B5CON_RTRRO_MASK                                   0x20
#define _B5CON_RXM1_POSN                                    0x6
#define _B5CON_RXM1_POSITION                                0x6
#define _B5CON_RXM1_SIZE                                    0x1
#define _B5CON_RXM1_LENGTH                                  0x1
#define _B5CON_RXM1_MASK                                    0x40
#define _B5CON_RXFUL_POSN                                   0x7
#define _B5CON_RXFUL_POSITION                               0x7
#define _B5CON_RXFUL_SIZE                                   0x1
#define _B5CON_RXFUL_LENGTH                                 0x1
#define _B5CON_RXFUL_MASK                                   0x80
#define _B5CON_TXPRI0_POSN                                  0x0
#define _B5CON_TXPRI0_POSITION                              0x0
#define _B5CON_TXPRI0_SIZE                                  0x1
#define _B5CON_TXPRI0_LENGTH                                0x1
#define _B5CON_TXPRI0_MASK                                  0x1
#define _B5CON_TXPRI1_POSN                                  0x1
#define _B5CON_TXPRI1_POSITION                              0x1
#define _B5CON_TXPRI1_SIZE                                  0x1
#define _B5CON_TXPRI1_LENGTH                                0x1
#define _B5CON_TXPRI1_MASK                                  0x2
#define _B5CON_RTREN_POSN                                   0x2
#define _B5CON_RTREN_POSITION                               0x2
#define _B5CON_RTREN_SIZE                                   0x1
#define _B5CON_RTREN_LENGTH                                 0x1
#define _B5CON_RTREN_MASK                                   0x4
#define _B5CON_TXREQ_POSN                                   0x3
#define _B5CON_TXREQ_POSITION                               0x3
#define _B5CON_TXREQ_SIZE                                   0x1
#define _B5CON_TXREQ_LENGTH                                 0x1
#define _B5CON_TXREQ_MASK                                   0x8
#define _B5CON_TXERR_POSN                                   0x4
#define _B5CON_TXERR_POSITION                               0x4
#define _B5CON_TXERR_SIZE                                   0x1
#define _B5CON_TXERR_LENGTH                                 0x1
#define _B5CON_TXERR_MASK                                   0x10
#define _B5CON_TXLARB_POSN                                  0x5
#define _B5CON_TXLARB_POSITION                              0x5
#define _B5CON_TXLARB_SIZE                                  0x1
#define _B5CON_TXLARB_LENGTH                                0x1
#define _B5CON_TXLARB_MASK                                  0x20
#define _B5CON_TXABT_POSN                                   0x6
#define _B5CON_TXABT_POSITION                               0x6
#define _B5CON_TXABT_SIZE                                   0x1
#define _B5CON_TXABT_LENGTH                                 0x1
#define _B5CON_TXABT_MASK                                   0x40
#define _B5CON_TXBIF_POSN                                   0x7
#define _B5CON_TXBIF_POSITION                               0x7
#define _B5CON_TXBIF_SIZE                                   0x1
#define _B5CON_TXBIF_LENGTH                                 0x1
#define _B5CON_TXBIF_MASK                                   0x80
#define _B5CON_B5FILHIT0_POSN                               0x0
#define _B5CON_B5FILHIT0_POSITION                           0x0
#define _B5CON_B5FILHIT0_SIZE                               0x1
#define _B5CON_B5FILHIT0_LENGTH                             0x1
#define _B5CON_B5FILHIT0_MASK                               0x1
#define _B5CON_B5FILHIT1_POSN                               0x1
#define _B5CON_B5FILHIT1_POSITION                           0x1
#define _B5CON_B5FILHIT1_SIZE                               0x1
#define _B5CON_B5FILHIT1_LENGTH                             0x1
#define _B5CON_B5FILHIT1_MASK                               0x2
#define _B5CON_B5FILHIT2_POSN                               0x2
#define _B5CON_B5FILHIT2_POSITION                           0x2
#define _B5CON_B5FILHIT2_SIZE                               0x1
#define _B5CON_B5FILHIT2_LENGTH                             0x1
#define _B5CON_B5FILHIT2_MASK                               0x4
#define _B5CON_B5FILHIT3_POSN                               0x3
#define _B5CON_B5FILHIT3_POSITION                           0x3
#define _B5CON_B5FILHIT3_SIZE                               0x1
#define _B5CON_B5FILHIT3_LENGTH                             0x1
#define _B5CON_B5FILHIT3_MASK                               0x8
#define _B5CON_B5FILHIT4_POSN                               0x4
#define _B5CON_B5FILHIT4_POSITION                           0x4
#define _B5CON_B5FILHIT4_SIZE                               0x1
#define _B5CON_B5FILHIT4_LENGTH                             0x1
#define _B5CON_B5FILHIT4_MASK                               0x10
#define _B5CON_B5RTRRO_POSN                                 0x5
#define _B5CON_B5RTRRO_POSITION                             0x5
#define _B5CON_B5RTRRO_SIZE                                 0x1
#define _B5CON_B5RTRRO_LENGTH                               0x1
#define _B5CON_B5RTRRO_MASK                                 0x20
#define _B5CON_B5RXM1_POSN                                  0x6
#define _B5CON_B5RXM1_POSITION                              0x6
#define _B5CON_B5RXM1_SIZE                                  0x1
#define _B5CON_B5RXM1_LENGTH                                0x1
#define _B5CON_B5RXM1_MASK                                  0x40
#define _B5CON_B5RXFUL_POSN                                 0x7
#define _B5CON_B5RXFUL_POSITION                             0x7
#define _B5CON_B5RXFUL_SIZE                                 0x1
#define _B5CON_B5RXFUL_LENGTH                               0x1
#define _B5CON_B5RXFUL_MASK                                 0x80
#define _B5CON_B5TXPRI0_POSN                                0x0
#define _B5CON_B5TXPRI0_POSITION                            0x0
#define _B5CON_B5TXPRI0_SIZE                                0x1
#define _B5CON_B5TXPRI0_LENGTH                              0x1
#define _B5CON_B5TXPRI0_MASK                                0x1
#define _B5CON_B5TXPRI1_POSN                                0x1
#define _B5CON_B5TXPRI1_POSITION                            0x1
#define _B5CON_B5TXPRI1_SIZE                                0x1
#define _B5CON_B5TXPRI1_LENGTH                              0x1
#define _B5CON_B5TXPRI1_MASK                                0x2
#define _B5CON_B5RTREN_POSN                                 0x2
#define _B5CON_B5RTREN_POSITION                             0x2
#define _B5CON_B5RTREN_SIZE                                 0x1
#define _B5CON_B5RTREN_LENGTH                               0x1
#define _B5CON_B5RTREN_MASK                                 0x4
#define _B5CON_B5TXREQ_POSN                                 0x3
#define _B5CON_B5TXREQ_POSITION                             0x3
#define _B5CON_B5TXREQ_SIZE                                 0x1
#define _B5CON_B5TXREQ_LENGTH                               0x1
#define _B5CON_B5TXREQ_MASK                                 0x8
#define _B5CON_B5TXERR_POSN                                 0x4
#define _B5CON_B5TXERR_POSITION                             0x4
#define _B5CON_B5TXERR_SIZE                                 0x1
#define _B5CON_B5TXERR_LENGTH                               0x1
#define _B5CON_B5TXERR_MASK                                 0x10
#define _B5CON_B5TXLARB_POSN                                0x5
#define _B5CON_B5TXLARB_POSITION                            0x5
#define _B5CON_B5TXLARB_SIZE                                0x1
#define _B5CON_B5TXLARB_LENGTH                              0x1
#define _B5CON_B5TXLARB_MASK                                0x20
#define _B5CON_B5TXABT_POSN                                 0x6
#define _B5CON_B5TXABT_POSITION                             0x6
#define _B5CON_B5TXABT_SIZE                                 0x1
#define _B5CON_B5TXABT_LENGTH                               0x1
#define _B5CON_B5TXABT_MASK                                 0x40
#define _B5CON_B5TXBIF_POSN                                 0x7
#define _B5CON_B5TXBIF_POSITION                             0x7
#define _B5CON_B5TXBIF_SIZE                                 0x1
#define _B5CON_B5TXBIF_LENGTH                               0x1
#define _B5CON_B5TXBIF_MASK                                 0x80

// Register: B5SIDH
#define B5SIDH B5SIDH
extern volatile unsigned char           B5SIDH              __at(0xE71);
#ifndef _LIB_BUILD
asm("B5SIDH equ 0E71h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SID3                   :1;
        unsigned SID4                   :1;
        unsigned SID5                   :1;
        unsigned SID6                   :1;
        unsigned SID7                   :1;
        unsigned SID8                   :1;
        unsigned SID9                   :1;
        unsigned SID10                  :1;
    };
    struct {
        unsigned B5SID3                 :1;
        unsigned B5SID4                 :1;
        unsigned B5SID5                 :1;
        unsigned B5SID6                 :1;
        unsigned B5SID7                 :1;
        unsigned B5SID8                 :1;
        unsigned B5SID9                 :1;
        unsigned B5SID10                :1;
    };
} B5SIDHbits_t;
