MikroElektronika/core_packages/PIC/XC8/def/PIC18F6585/mcu.h
extern volatile B5SIDHbits_t B5SIDHbits __at(0xE71);
// bitfield macros
#define _B5SIDH_SID3_POSN                                   0x0
#define _B5SIDH_SID3_POSITION                               0x0
#define _B5SIDH_SID3_SIZE                                   0x1
#define _B5SIDH_SID3_LENGTH                                 0x1
#define _B5SIDH_SID3_MASK                                   0x1
#define _B5SIDH_SID4_POSN                                   0x1
#define _B5SIDH_SID4_POSITION                               0x1
#define _B5SIDH_SID4_SIZE                                   0x1
#define _B5SIDH_SID4_LENGTH                                 0x1
#define _B5SIDH_SID4_MASK                                   0x2
#define _B5SIDH_SID5_POSN                                   0x2
#define _B5SIDH_SID5_POSITION                               0x2
#define _B5SIDH_SID5_SIZE                                   0x1
#define _B5SIDH_SID5_LENGTH                                 0x1
#define _B5SIDH_SID5_MASK                                   0x4
#define _B5SIDH_SID6_POSN                                   0x3
#define _B5SIDH_SID6_POSITION                               0x3
#define _B5SIDH_SID6_SIZE                                   0x1
#define _B5SIDH_SID6_LENGTH                                 0x1
#define _B5SIDH_SID6_MASK                                   0x8
#define _B5SIDH_SID7_POSN                                   0x4
#define _B5SIDH_SID7_POSITION                               0x4
#define _B5SIDH_SID7_SIZE                                   0x1
#define _B5SIDH_SID7_LENGTH                                 0x1
#define _B5SIDH_SID7_MASK                                   0x10
#define _B5SIDH_SID8_POSN                                   0x5
#define _B5SIDH_SID8_POSITION                               0x5
#define _B5SIDH_SID8_SIZE                                   0x1
#define _B5SIDH_SID8_LENGTH                                 0x1
#define _B5SIDH_SID8_MASK                                   0x20
#define _B5SIDH_SID9_POSN                                   0x6
#define _B5SIDH_SID9_POSITION                               0x6
#define _B5SIDH_SID9_SIZE                                   0x1
#define _B5SIDH_SID9_LENGTH                                 0x1
#define _B5SIDH_SID9_MASK                                   0x40
#define _B5SIDH_SID10_POSN                                  0x7
#define _B5SIDH_SID10_POSITION                              0x7
#define _B5SIDH_SID10_SIZE                                  0x1
#define _B5SIDH_SID10_LENGTH                                0x1
#define _B5SIDH_SID10_MASK                                  0x80
#define _B5SIDH_B5SID3_POSN                                 0x0
#define _B5SIDH_B5SID3_POSITION                             0x0
#define _B5SIDH_B5SID3_SIZE                                 0x1
#define _B5SIDH_B5SID3_LENGTH                               0x1
#define _B5SIDH_B5SID3_MASK                                 0x1
#define _B5SIDH_B5SID4_POSN                                 0x1
#define _B5SIDH_B5SID4_POSITION                             0x1
#define _B5SIDH_B5SID4_SIZE                                 0x1
#define _B5SIDH_B5SID4_LENGTH                               0x1
#define _B5SIDH_B5SID4_MASK                                 0x2
#define _B5SIDH_B5SID5_POSN                                 0x2
#define _B5SIDH_B5SID5_POSITION                             0x2
#define _B5SIDH_B5SID5_SIZE                                 0x1
#define _B5SIDH_B5SID5_LENGTH                               0x1
#define _B5SIDH_B5SID5_MASK                                 0x4
#define _B5SIDH_B5SID6_POSN                                 0x3
#define _B5SIDH_B5SID6_POSITION                             0x3
#define _B5SIDH_B5SID6_SIZE                                 0x1
#define _B5SIDH_B5SID6_LENGTH                               0x1
#define _B5SIDH_B5SID6_MASK                                 0x8
#define _B5SIDH_B5SID7_POSN                                 0x4
#define _B5SIDH_B5SID7_POSITION                             0x4
#define _B5SIDH_B5SID7_SIZE                                 0x1
#define _B5SIDH_B5SID7_LENGTH                               0x1
#define _B5SIDH_B5SID7_MASK                                 0x10
#define _B5SIDH_B5SID8_POSN                                 0x5
#define _B5SIDH_B5SID8_POSITION                             0x5
#define _B5SIDH_B5SID8_SIZE                                 0x1
#define _B5SIDH_B5SID8_LENGTH                               0x1
#define _B5SIDH_B5SID8_MASK                                 0x20
#define _B5SIDH_B5SID9_POSN                                 0x6
#define _B5SIDH_B5SID9_POSITION                             0x6
#define _B5SIDH_B5SID9_SIZE                                 0x1
#define _B5SIDH_B5SID9_LENGTH                               0x1
#define _B5SIDH_B5SID9_MASK                                 0x40
#define _B5SIDH_B5SID10_POSN                                0x7
#define _B5SIDH_B5SID10_POSITION                            0x7
#define _B5SIDH_B5SID10_SIZE                                0x1
#define _B5SIDH_B5SID10_LENGTH                              0x1
#define _B5SIDH_B5SID10_MASK                                0x80

// Register: B5SIDL
#define B5SIDL B5SIDL
extern volatile unsigned char           B5SIDL              __at(0xE72);
#ifndef _LIB_BUILD
asm("B5SIDL equ 0E72h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID16                  :1;
        unsigned EID17                  :1;
        unsigned                        :1;
        unsigned EXID                   :1;
        unsigned SRR                    :1;
        unsigned SID0                   :1;
        unsigned SID1                   :1;
        unsigned SID2                   :1;
    };
    struct {
        unsigned                        :3;
        unsigned EXIDE                  :1;
    };
    struct {
        unsigned B5EID16                :1;
        unsigned B5EID17                :1;
        unsigned                        :1;
        unsigned B5EXID                 :1;
        unsigned B5SRR                  :1;
        unsigned B5SID0                 :1;
        unsigned B5SID1                 :1;
        unsigned B5SID2                 :1;
    };
    struct {
        unsigned                        :3;
        unsigned B5EXIDE                :1;
    };
} B5SIDLbits_t;
extern volatile B5SIDLbits_t B5SIDLbits __at(0xE72);
// bitfield macros
#define _B5SIDL_EID16_POSN                                  0x0
#define _B5SIDL_EID16_POSITION                              0x0
#define _B5SIDL_EID16_SIZE                                  0x1
#define _B5SIDL_EID16_LENGTH                                0x1
#define _B5SIDL_EID16_MASK                                  0x1
#define _B5SIDL_EID17_POSN                                  0x1
#define _B5SIDL_EID17_POSITION                              0x1
#define _B5SIDL_EID17_SIZE                                  0x1
#define _B5SIDL_EID17_LENGTH                                0x1
#define _B5SIDL_EID17_MASK                                  0x2
#define _B5SIDL_EXID_POSN                                   0x3
#define _B5SIDL_EXID_POSITION                               0x3
#define _B5SIDL_EXID_SIZE                                   0x1
#define _B5SIDL_EXID_LENGTH                                 0x1
#define _B5SIDL_EXID_MASK                                   0x8
#define _B5SIDL_SRR_POSN                                    0x4
#define _B5SIDL_SRR_POSITION                                0x4
#define _B5SIDL_SRR_SIZE                                    0x1
#define _B5SIDL_SRR_LENGTH                                  0x1
#define _B5SIDL_SRR_MASK                                    0x10
#define _B5SIDL_SID0_POSN                                   0x5
#define _B5SIDL_SID0_POSITION                               0x5
#define _B5SIDL_SID0_SIZE                                   0x1
#define _B5SIDL_SID0_LENGTH                                 0x1
#define _B5SIDL_SID0_MASK                                   0x20
#define _B5SIDL_SID1_POSN                                   0x6
#define _B5SIDL_SID1_POSITION                               0x6
#define _B5SIDL_SID1_SIZE                                   0x1
#define _B5SIDL_SID1_LENGTH                                 0x1
#define _B5SIDL_SID1_MASK                                   0x40
#define _B5SIDL_SID2_POSN                                   0x7
#define _B5SIDL_SID2_POSITION                               0x7
#define _B5SIDL_SID2_SIZE                                   0x1
#define _B5SIDL_SID2_LENGTH                                 0x1
#define _B5SIDL_SID2_MASK                                   0x80
#define _B5SIDL_EXIDE_POSN                                  0x3
#define _B5SIDL_EXIDE_POSITION                              0x3
#define _B5SIDL_EXIDE_SIZE                                  0x1
#define _B5SIDL_EXIDE_LENGTH                                0x1
#define _B5SIDL_EXIDE_MASK                                  0x8
#define _B5SIDL_B5EID16_POSN                                0x0
#define _B5SIDL_B5EID16_POSITION                            0x0
#define _B5SIDL_B5EID16_SIZE                                0x1
#define _B5SIDL_B5EID16_LENGTH                              0x1
#define _B5SIDL_B5EID16_MASK                                0x1
#define _B5SIDL_B5EID17_POSN                                0x1
#define _B5SIDL_B5EID17_POSITION                            0x1
#define _B5SIDL_B5EID17_SIZE                                0x1
#define _B5SIDL_B5EID17_LENGTH                              0x1
#define _B5SIDL_B5EID17_MASK                                0x2
#define _B5SIDL_B5EXID_POSN                                 0x3
#define _B5SIDL_B5EXID_POSITION                             0x3
#define _B5SIDL_B5EXID_SIZE                                 0x1
#define _B5SIDL_B5EXID_LENGTH                               0x1
#define _B5SIDL_B5EXID_MASK                                 0x8
#define _B5SIDL_B5SRR_POSN                                  0x4
#define _B5SIDL_B5SRR_POSITION                              0x4
#define _B5SIDL_B5SRR_SIZE                                  0x1
#define _B5SIDL_B5SRR_LENGTH                                0x1
#define _B5SIDL_B5SRR_MASK                                  0x10
#define _B5SIDL_B5SID0_POSN                                 0x5
#define _B5SIDL_B5SID0_POSITION                             0x5
#define _B5SIDL_B5SID0_SIZE                                 0x1
#define _B5SIDL_B5SID0_LENGTH                               0x1
#define _B5SIDL_B5SID0_MASK                                 0x20
#define _B5SIDL_B5SID1_POSN                                 0x6
#define _B5SIDL_B5SID1_POSITION                             0x6
#define _B5SIDL_B5SID1_SIZE                                 0x1
#define _B5SIDL_B5SID1_LENGTH                               0x1
#define _B5SIDL_B5SID1_MASK                                 0x40
#define _B5SIDL_B5SID2_POSN                                 0x7
#define _B5SIDL_B5SID2_POSITION                             0x7
#define _B5SIDL_B5SID2_SIZE                                 0x1
#define _B5SIDL_B5SID2_LENGTH                               0x1
#define _B5SIDL_B5SID2_MASK                                 0x80
#define _B5SIDL_B5EXIDE_POSN                                0x3
#define _B5SIDL_B5EXIDE_POSITION                            0x3
#define _B5SIDL_B5EXIDE_SIZE                                0x1
#define _B5SIDL_B5EXIDE_LENGTH                              0x1
#define _B5SIDL_B5EXIDE_MASK                                0x8

// Register: B5EIDH
#define B5EIDH B5EIDH
extern volatile unsigned char           B5EIDH              __at(0xE73);
#ifndef _LIB_BUILD
asm("B5EIDH equ 0E73h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID8                   :1;
        unsigned EID9                   :1;
        unsigned EID10                  :1;
        unsigned EID11                  :1;
        unsigned EID12                  :1;
        unsigned EID13                  :1;
        unsigned EID14                  :1;
        unsigned EID15                  :1;
    };
    struct {
        unsigned B5EID8                 :1;
        unsigned B5EID9                 :1;
        unsigned B5EID10                :1;
        unsigned B5EID11                :1;
        unsigned B5EID12                :1;
        unsigned B5EID13                :1;
        unsigned B5EID14                :1;
        unsigned B5EID15                :1;
    };
} B5EIDHbits_t;
extern volatile B5EIDHbits_t B5EIDHbits __at(0xE73);
// bitfield macros
#define _B5EIDH_EID8_POSN                                   0x0
#define _B5EIDH_EID8_POSITION                               0x0
#define _B5EIDH_EID8_SIZE                                   0x1
#define _B5EIDH_EID8_LENGTH                                 0x1
#define _B5EIDH_EID8_MASK                                   0x1
#define _B5EIDH_EID9_POSN                                   0x1
#define _B5EIDH_EID9_POSITION                               0x1
#define _B5EIDH_EID9_SIZE                                   0x1
#define _B5EIDH_EID9_LENGTH                                 0x1
#define _B5EIDH_EID9_MASK                                   0x2
#define _B5EIDH_EID10_POSN                                  0x2
#define _B5EIDH_EID10_POSITION                              0x2
#define _B5EIDH_EID10_SIZE                                  0x1
#define _B5EIDH_EID10_LENGTH                                0x1
#define _B5EIDH_EID10_MASK                                  0x4
#define _B5EIDH_EID11_POSN                                  0x3
#define _B5EIDH_EID11_POSITION                              0x3
#define _B5EIDH_EID11_SIZE                                  0x1
#define _B5EIDH_EID11_LENGTH                                0x1
#define _B5EIDH_EID11_MASK                                  0x8
#define _B5EIDH_EID12_POSN                                  0x4
#define _B5EIDH_EID12_POSITION                              0x4
#define _B5EIDH_EID12_SIZE                                  0x1
#define _B5EIDH_EID12_LENGTH                                0x1
#define _B5EIDH_EID12_MASK                                  0x10
#define _B5EIDH_EID13_POSN                                  0x5
#define _B5EIDH_EID13_POSITION                              0x5
#define _B5EIDH_EID13_SIZE                                  0x1
#define _B5EIDH_EID13_LENGTH                                0x1
#define _B5EIDH_EID13_MASK                                  0x20
#define _B5EIDH_EID14_POSN                                  0x6
#define _B5EIDH_EID14_POSITION                              0x6
#define _B5EIDH_EID14_SIZE                                  0x1
#define _B5EIDH_EID14_LENGTH                                0x1
#define _B5EIDH_EID14_MASK                                  0x40
#define _B5EIDH_EID15_POSN                                  0x7
#define _B5EIDH_EID15_POSITION                              0x7
#define _B5EIDH_EID15_SIZE                                  0x1
#define _B5EIDH_EID15_LENGTH                                0x1
#define _B5EIDH_EID15_MASK                                  0x80
#define _B5EIDH_B5EID8_POSN                                 0x0
#define _B5EIDH_B5EID8_POSITION                             0x0
#define _B5EIDH_B5EID8_SIZE                                 0x1
#define _B5EIDH_B5EID8_LENGTH                               0x1
#define _B5EIDH_B5EID8_MASK                                 0x1
#define _B5EIDH_B5EID9_POSN                                 0x1
#define _B5EIDH_B5EID9_POSITION                             0x1
#define _B5EIDH_B5EID9_SIZE                                 0x1
#define _B5EIDH_B5EID9_LENGTH                               0x1
#define _B5EIDH_B5EID9_MASK                                 0x2
#define _B5EIDH_B5EID10_POSN                                0x2
#define _B5EIDH_B5EID10_POSITION                            0x2
#define _B5EIDH_B5EID10_SIZE                                0x1
#define _B5EIDH_B5EID10_LENGTH                              0x1
#define _B5EIDH_B5EID10_MASK                                0x4
#define _B5EIDH_B5EID11_POSN                                0x3
#define _B5EIDH_B5EID11_POSITION                            0x3
#define _B5EIDH_B5EID11_SIZE                                0x1
#define _B5EIDH_B5EID11_LENGTH                              0x1
#define _B5EIDH_B5EID11_MASK                                0x8
#define _B5EIDH_B5EID12_POSN                                0x4
#define _B5EIDH_B5EID12_POSITION                            0x4
#define _B5EIDH_B5EID12_SIZE                                0x1
#define _B5EIDH_B5EID12_LENGTH                              0x1
#define _B5EIDH_B5EID12_MASK                                0x10
#define _B5EIDH_B5EID13_POSN                                0x5
#define _B5EIDH_B5EID13_POSITION                            0x5
#define _B5EIDH_B5EID13_SIZE                                0x1
#define _B5EIDH_B5EID13_LENGTH                              0x1
#define _B5EIDH_B5EID13_MASK                                0x20
#define _B5EIDH_B5EID14_POSN                                0x6
#define _B5EIDH_B5EID14_POSITION                            0x6
#define _B5EIDH_B5EID14_SIZE                                0x1
#define _B5EIDH_B5EID14_LENGTH                              0x1
#define _B5EIDH_B5EID14_MASK                                0x40
#define _B5EIDH_B5EID15_POSN                                0x7
#define _B5EIDH_B5EID15_POSITION                            0x7
#define _B5EIDH_B5EID15_SIZE                                0x1
#define _B5EIDH_B5EID15_LENGTH                              0x1
#define _B5EIDH_B5EID15_MASK                                0x80

// Register: B5EIDL
#define B5EIDL B5EIDL
extern volatile unsigned char           B5EIDL              __at(0xE74);
#ifndef _LIB_BUILD
asm("B5EIDL equ 0E74h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID0                   :1;
        unsigned EID1                   :1;
        unsigned EID2                   :1;
        unsigned EID3                   :1;
        unsigned EID4                   :1;
        unsigned EID5                   :1;
        unsigned EID6                   :1;
        unsigned EID7                   :1;
    };
    struct {
        unsigned B5EID0                 :1;
        unsigned B5EID1                 :1;
        unsigned B5EID2                 :1;
        unsigned B5EID3                 :1;
        unsigned B5EID4                 :1;
        unsigned B5EID5                 :1;
        unsigned B5EID6                 :1;
        unsigned B5EID7                 :1;
    };
} B5EIDLbits_t;
extern volatile B5EIDLbits_t B5EIDLbits __at(0xE74);
// bitfield macros
#define _B5EIDL_EID0_POSN                                   0x0
#define _B5EIDL_EID0_POSITION                               0x0
#define _B5EIDL_EID0_SIZE                                   0x1
#define _B5EIDL_EID0_LENGTH                                 0x1
#define _B5EIDL_EID0_MASK                                   0x1
#define _B5EIDL_EID1_POSN                                   0x1
#define _B5EIDL_EID1_POSITION                               0x1
#define _B5EIDL_EID1_SIZE                                   0x1
#define _B5EIDL_EID1_LENGTH                                 0x1
#define _B5EIDL_EID1_MASK                                   0x2
#define _B5EIDL_EID2_POSN                                   0x2
#define _B5EIDL_EID2_POSITION                               0x2
#define _B5EIDL_EID2_SIZE                                   0x1
#define _B5EIDL_EID2_LENGTH                                 0x1
#define _B5EIDL_EID2_MASK                                   0x4
#define _B5EIDL_EID3_POSN                                   0x3
#define _B5EIDL_EID3_POSITION                               0x3
#define _B5EIDL_EID3_SIZE                                   0x1
#define _B5EIDL_EID3_LENGTH                                 0x1
#define _B5EIDL_EID3_MASK                                   0x8
#define _B5EIDL_EID4_POSN                                   0x4
#define _B5EIDL_EID4_POSITION                               0x4
#define _B5EIDL_EID4_SIZE                                   0x1
#define _B5EIDL_EID4_LENGTH                                 0x1
#define _B5EIDL_EID4_MASK                                   0x10
#define _B5EIDL_EID5_POSN                                   0x5
#define _B5EIDL_EID5_POSITION                               0x5
#define _B5EIDL_EID5_SIZE                                   0x1
#define _B5EIDL_EID5_LENGTH                                 0x1
#define _B5EIDL_EID5_MASK                                   0x20
#define _B5EIDL_EID6_POSN                                   0x6
#define _B5EIDL_EID6_POSITION                               0x6
#define _B5EIDL_EID6_SIZE                                   0x1
#define _B5EIDL_EID6_LENGTH                                 0x1
#define _B5EIDL_EID6_MASK                                   0x40
#define _B5EIDL_EID7_POSN                                   0x7
#define _B5EIDL_EID7_POSITION                               0x7
#define _B5EIDL_EID7_SIZE                                   0x1
#define _B5EIDL_EID7_LENGTH                                 0x1
#define _B5EIDL_EID7_MASK                                   0x80
#define _B5EIDL_B5EID0_POSN                                 0x0
#define _B5EIDL_B5EID0_POSITION                             0x0
#define _B5EIDL_B5EID0_SIZE                                 0x1
#define _B5EIDL_B5EID0_LENGTH                               0x1
#define _B5EIDL_B5EID0_MASK                                 0x1
#define _B5EIDL_B5EID1_POSN                                 0x1
#define _B5EIDL_B5EID1_POSITION                             0x1
#define _B5EIDL_B5EID1_SIZE                                 0x1
#define _B5EIDL_B5EID1_LENGTH                               0x1
#define _B5EIDL_B5EID1_MASK                                 0x2
#define _B5EIDL_B5EID2_POSN                                 0x2
#define _B5EIDL_B5EID2_POSITION                             0x2
#define _B5EIDL_B5EID2_SIZE                                 0x1
#define _B5EIDL_B5EID2_LENGTH                               0x1
#define _B5EIDL_B5EID2_MASK                                 0x4
#define _B5EIDL_B5EID3_POSN                                 0x3
#define _B5EIDL_B5EID3_POSITION                             0x3
#define _B5EIDL_B5EID3_SIZE                                 0x1
#define _B5EIDL_B5EID3_LENGTH                               0x1
#define _B5EIDL_B5EID3_MASK                                 0x8
#define _B5EIDL_B5EID4_POSN                                 0x4
#define _B5EIDL_B5EID4_POSITION                             0x4
#define _B5EIDL_B5EID4_SIZE                                 0x1
#define _B5EIDL_B5EID4_LENGTH                               0x1
#define _B5EIDL_B5EID4_MASK                                 0x10
#define _B5EIDL_B5EID5_POSN                                 0x5
#define _B5EIDL_B5EID5_POSITION                             0x5
#define _B5EIDL_B5EID5_SIZE                                 0x1
#define _B5EIDL_B5EID5_LENGTH                               0x1
#define _B5EIDL_B5EID5_MASK                                 0x20
#define _B5EIDL_B5EID6_POSN                                 0x6
#define _B5EIDL_B5EID6_POSITION                             0x6
#define _B5EIDL_B5EID6_SIZE                                 0x1
#define _B5EIDL_B5EID6_LENGTH                               0x1
#define _B5EIDL_B5EID6_MASK                                 0x40
#define _B5EIDL_B5EID7_POSN                                 0x7
#define _B5EIDL_B5EID7_POSITION                             0x7
#define _B5EIDL_B5EID7_SIZE                                 0x1
#define _B5EIDL_B5EID7_LENGTH                               0x1
#define _B5EIDL_B5EID7_MASK                                 0x80

