MikroElektronika/core_packages/PIC/XC8/def/PIC18F6585/mcu.h
// Register: RXF3SIDH
#define RXF3SIDH RXF3SIDH
extern volatile unsigned char           RXF3SIDH            __at(0xF0C);
#ifndef _LIB_BUILD
asm("RXF3SIDH equ 0F0Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SID3                   :1;
        unsigned SID4                   :1;
        unsigned SID5                   :1;
        unsigned SID6                   :1;
        unsigned SID7                   :1;
        unsigned SID8                   :1;
        unsigned SID9                   :1;
        unsigned SID10                  :1;
    };
    struct {
        unsigned RXF3SID3               :1;
        unsigned RXF3SID4               :1;
        unsigned RXF3SID5               :1;
        unsigned RXF3SID6               :1;
        unsigned RXF3SID7               :1;
        unsigned RXF3SID8               :1;
        unsigned RXF3SID9               :1;
        unsigned RXF3SID10              :1;
    };
} RXF3SIDHbits_t;
extern volatile RXF3SIDHbits_t RXF3SIDHbits __at(0xF0C);
// bitfield macros
#define _RXF3SIDH_SID3_POSN                                 0x0
#define _RXF3SIDH_SID3_POSITION                             0x0
#define _RXF3SIDH_SID3_SIZE                                 0x1
#define _RXF3SIDH_SID3_LENGTH                               0x1
#define _RXF3SIDH_SID3_MASK                                 0x1
#define _RXF3SIDH_SID4_POSN                                 0x1
#define _RXF3SIDH_SID4_POSITION                             0x1
#define _RXF3SIDH_SID4_SIZE                                 0x1
#define _RXF3SIDH_SID4_LENGTH                               0x1
#define _RXF3SIDH_SID4_MASK                                 0x2
#define _RXF3SIDH_SID5_POSN                                 0x2
#define _RXF3SIDH_SID5_POSITION                             0x2
#define _RXF3SIDH_SID5_SIZE                                 0x1
#define _RXF3SIDH_SID5_LENGTH                               0x1
#define _RXF3SIDH_SID5_MASK                                 0x4
#define _RXF3SIDH_SID6_POSN                                 0x3
#define _RXF3SIDH_SID6_POSITION                             0x3
#define _RXF3SIDH_SID6_SIZE                                 0x1
#define _RXF3SIDH_SID6_LENGTH                               0x1
#define _RXF3SIDH_SID6_MASK                                 0x8
#define _RXF3SIDH_SID7_POSN                                 0x4
#define _RXF3SIDH_SID7_POSITION                             0x4
#define _RXF3SIDH_SID7_SIZE                                 0x1
#define _RXF3SIDH_SID7_LENGTH                               0x1
#define _RXF3SIDH_SID7_MASK                                 0x10
#define _RXF3SIDH_SID8_POSN                                 0x5
#define _RXF3SIDH_SID8_POSITION                             0x5
#define _RXF3SIDH_SID8_SIZE                                 0x1
#define _RXF3SIDH_SID8_LENGTH                               0x1
#define _RXF3SIDH_SID8_MASK                                 0x20
#define _RXF3SIDH_SID9_POSN                                 0x6
#define _RXF3SIDH_SID9_POSITION                             0x6
#define _RXF3SIDH_SID9_SIZE                                 0x1
#define _RXF3SIDH_SID9_LENGTH                               0x1
#define _RXF3SIDH_SID9_MASK                                 0x40
#define _RXF3SIDH_SID10_POSN                                0x7
#define _RXF3SIDH_SID10_POSITION                            0x7
#define _RXF3SIDH_SID10_SIZE                                0x1
#define _RXF3SIDH_SID10_LENGTH                              0x1
#define _RXF3SIDH_SID10_MASK                                0x80
#define _RXF3SIDH_RXF3SID3_POSN                             0x0
#define _RXF3SIDH_RXF3SID3_POSITION                         0x0
#define _RXF3SIDH_RXF3SID3_SIZE                             0x1
#define _RXF3SIDH_RXF3SID3_LENGTH                           0x1
#define _RXF3SIDH_RXF3SID3_MASK                             0x1
#define _RXF3SIDH_RXF3SID4_POSN                             0x1
#define _RXF3SIDH_RXF3SID4_POSITION                         0x1
#define _RXF3SIDH_RXF3SID4_SIZE                             0x1
#define _RXF3SIDH_RXF3SID4_LENGTH                           0x1
#define _RXF3SIDH_RXF3SID4_MASK                             0x2
#define _RXF3SIDH_RXF3SID5_POSN                             0x2
#define _RXF3SIDH_RXF3SID5_POSITION                         0x2
#define _RXF3SIDH_RXF3SID5_SIZE                             0x1
#define _RXF3SIDH_RXF3SID5_LENGTH                           0x1
#define _RXF3SIDH_RXF3SID5_MASK                             0x4
#define _RXF3SIDH_RXF3SID6_POSN                             0x3
#define _RXF3SIDH_RXF3SID6_POSITION                         0x3
#define _RXF3SIDH_RXF3SID6_SIZE                             0x1
#define _RXF3SIDH_RXF3SID6_LENGTH                           0x1
#define _RXF3SIDH_RXF3SID6_MASK                             0x8
#define _RXF3SIDH_RXF3SID7_POSN                             0x4
#define _RXF3SIDH_RXF3SID7_POSITION                         0x4
#define _RXF3SIDH_RXF3SID7_SIZE                             0x1
#define _RXF3SIDH_RXF3SID7_LENGTH                           0x1
#define _RXF3SIDH_RXF3SID7_MASK                             0x10
#define _RXF3SIDH_RXF3SID8_POSN                             0x5
#define _RXF3SIDH_RXF3SID8_POSITION                         0x5
#define _RXF3SIDH_RXF3SID8_SIZE                             0x1
#define _RXF3SIDH_RXF3SID8_LENGTH                           0x1
#define _RXF3SIDH_RXF3SID8_MASK                             0x20
#define _RXF3SIDH_RXF3SID9_POSN                             0x6
#define _RXF3SIDH_RXF3SID9_POSITION                         0x6
#define _RXF3SIDH_RXF3SID9_SIZE                             0x1
#define _RXF3SIDH_RXF3SID9_LENGTH                           0x1
#define _RXF3SIDH_RXF3SID9_MASK                             0x40
#define _RXF3SIDH_RXF3SID10_POSN                            0x7
#define _RXF3SIDH_RXF3SID10_POSITION                        0x7
#define _RXF3SIDH_RXF3SID10_SIZE                            0x1
#define _RXF3SIDH_RXF3SID10_LENGTH                          0x1
#define _RXF3SIDH_RXF3SID10_MASK                            0x80

// Register: RXF3SIDL
#define RXF3SIDL RXF3SIDL
extern volatile unsigned char           RXF3SIDL            __at(0xF0D);
#ifndef _LIB_BUILD
asm("RXF3SIDL equ 0F0Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID16                  :1;
        unsigned EID17                  :1;
        unsigned                        :1;
        unsigned EXIDEN                 :1;
        unsigned                        :1;
        unsigned SID0                   :1;
        unsigned SID1                   :1;
        unsigned SID2                   :1;
    };
    struct {
        unsigned                        :3;
        unsigned EXIDE                  :1;
    };
    struct {
        unsigned RXF3EID16              :1;
        unsigned RXF3EID17              :1;
        unsigned                        :1;
        unsigned RXF3EXIDEN             :1;
        unsigned                        :1;
        unsigned RXF3SID0               :1;
        unsigned RXF3SID1               :1;
        unsigned RXF3SID2               :1;
    };
} RXF3SIDLbits_t;
extern volatile RXF3SIDLbits_t RXF3SIDLbits __at(0xF0D);
// bitfield macros
#define _RXF3SIDL_EID16_POSN                                0x0
#define _RXF3SIDL_EID16_POSITION                            0x0
#define _RXF3SIDL_EID16_SIZE                                0x1
#define _RXF3SIDL_EID16_LENGTH                              0x1
#define _RXF3SIDL_EID16_MASK                                0x1
#define _RXF3SIDL_EID17_POSN                                0x1
#define _RXF3SIDL_EID17_POSITION                            0x1
#define _RXF3SIDL_EID17_SIZE                                0x1
#define _RXF3SIDL_EID17_LENGTH                              0x1
#define _RXF3SIDL_EID17_MASK                                0x2
#define _RXF3SIDL_EXIDEN_POSN                               0x3
#define _RXF3SIDL_EXIDEN_POSITION                           0x3
#define _RXF3SIDL_EXIDEN_SIZE                               0x1
#define _RXF3SIDL_EXIDEN_LENGTH                             0x1
#define _RXF3SIDL_EXIDEN_MASK                               0x8
#define _RXF3SIDL_SID0_POSN                                 0x5
#define _RXF3SIDL_SID0_POSITION                             0x5
#define _RXF3SIDL_SID0_SIZE                                 0x1
#define _RXF3SIDL_SID0_LENGTH                               0x1
#define _RXF3SIDL_SID0_MASK                                 0x20
#define _RXF3SIDL_SID1_POSN                                 0x6
#define _RXF3SIDL_SID1_POSITION                             0x6
#define _RXF3SIDL_SID1_SIZE                                 0x1
#define _RXF3SIDL_SID1_LENGTH                               0x1
#define _RXF3SIDL_SID1_MASK                                 0x40
#define _RXF3SIDL_SID2_POSN                                 0x7
#define _RXF3SIDL_SID2_POSITION                             0x7
#define _RXF3SIDL_SID2_SIZE                                 0x1
#define _RXF3SIDL_SID2_LENGTH                               0x1
#define _RXF3SIDL_SID2_MASK                                 0x80
#define _RXF3SIDL_EXIDE_POSN                                0x3
#define _RXF3SIDL_EXIDE_POSITION                            0x3
#define _RXF3SIDL_EXIDE_SIZE                                0x1
#define _RXF3SIDL_EXIDE_LENGTH                              0x1
#define _RXF3SIDL_EXIDE_MASK                                0x8
#define _RXF3SIDL_RXF3EID16_POSN                            0x0
#define _RXF3SIDL_RXF3EID16_POSITION                        0x0
#define _RXF3SIDL_RXF3EID16_SIZE                            0x1
#define _RXF3SIDL_RXF3EID16_LENGTH                          0x1
#define _RXF3SIDL_RXF3EID16_MASK                            0x1
#define _RXF3SIDL_RXF3EID17_POSN                            0x1
#define _RXF3SIDL_RXF3EID17_POSITION                        0x1
#define _RXF3SIDL_RXF3EID17_SIZE                            0x1
#define _RXF3SIDL_RXF3EID17_LENGTH                          0x1
#define _RXF3SIDL_RXF3EID17_MASK                            0x2
#define _RXF3SIDL_RXF3EXIDEN_POSN                           0x3
#define _RXF3SIDL_RXF3EXIDEN_POSITION                       0x3
#define _RXF3SIDL_RXF3EXIDEN_SIZE                           0x1
#define _RXF3SIDL_RXF3EXIDEN_LENGTH                         0x1
#define _RXF3SIDL_RXF3EXIDEN_MASK                           0x8
#define _RXF3SIDL_RXF3SID0_POSN                             0x5
#define _RXF3SIDL_RXF3SID0_POSITION                         0x5
#define _RXF3SIDL_RXF3SID0_SIZE                             0x1
#define _RXF3SIDL_RXF3SID0_LENGTH                           0x1
#define _RXF3SIDL_RXF3SID0_MASK                             0x20
#define _RXF3SIDL_RXF3SID1_POSN                             0x6
#define _RXF3SIDL_RXF3SID1_POSITION                         0x6
#define _RXF3SIDL_RXF3SID1_SIZE                             0x1
#define _RXF3SIDL_RXF3SID1_LENGTH                           0x1
#define _RXF3SIDL_RXF3SID1_MASK                             0x40
#define _RXF3SIDL_RXF3SID2_POSN                             0x7
#define _RXF3SIDL_RXF3SID2_POSITION                         0x7
#define _RXF3SIDL_RXF3SID2_SIZE                             0x1
#define _RXF3SIDL_RXF3SID2_LENGTH                           0x1
#define _RXF3SIDL_RXF3SID2_MASK                             0x80

// Register: RXF3EIDH
#define RXF3EIDH RXF3EIDH
extern volatile unsigned char           RXF3EIDH            __at(0xF0E);
#ifndef _LIB_BUILD
asm("RXF3EIDH equ 0F0Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID8                   :1;
        unsigned EID9                   :1;
        unsigned EID10                  :1;
        unsigned EID11                  :1;
        unsigned EID12                  :1;
        unsigned EID13                  :1;
        unsigned EID14                  :1;
        unsigned EID15                  :1;
    };
    struct {
        unsigned RXF3EID8               :1;
        unsigned RXF3EID9               :1;
        unsigned RXF3EID10              :1;
        unsigned RXF3EID11              :1;
        unsigned RXF3EID12              :1;
        unsigned RXF3EID13              :1;
        unsigned RXF3EID14              :1;
        unsigned RXF3EID15              :1;
    };
} RXF3EIDHbits_t;
extern volatile RXF3EIDHbits_t RXF3EIDHbits __at(0xF0E);
// bitfield macros
#define _RXF3EIDH_EID8_POSN                                 0x0
#define _RXF3EIDH_EID8_POSITION                             0x0
#define _RXF3EIDH_EID8_SIZE                                 0x1
#define _RXF3EIDH_EID8_LENGTH                               0x1
#define _RXF3EIDH_EID8_MASK                                 0x1
#define _RXF3EIDH_EID9_POSN                                 0x1
#define _RXF3EIDH_EID9_POSITION                             0x1
#define _RXF3EIDH_EID9_SIZE                                 0x1
#define _RXF3EIDH_EID9_LENGTH                               0x1
#define _RXF3EIDH_EID9_MASK                                 0x2
#define _RXF3EIDH_EID10_POSN                                0x2
#define _RXF3EIDH_EID10_POSITION                            0x2
#define _RXF3EIDH_EID10_SIZE                                0x1
#define _RXF3EIDH_EID10_LENGTH                              0x1
#define _RXF3EIDH_EID10_MASK                                0x4
#define _RXF3EIDH_EID11_POSN                                0x3
#define _RXF3EIDH_EID11_POSITION                            0x3
#define _RXF3EIDH_EID11_SIZE                                0x1
#define _RXF3EIDH_EID11_LENGTH                              0x1
#define _RXF3EIDH_EID11_MASK                                0x8
#define _RXF3EIDH_EID12_POSN                                0x4
#define _RXF3EIDH_EID12_POSITION                            0x4
#define _RXF3EIDH_EID12_SIZE                                0x1
#define _RXF3EIDH_EID12_LENGTH                              0x1
#define _RXF3EIDH_EID12_MASK                                0x10
#define _RXF3EIDH_EID13_POSN                                0x5
#define _RXF3EIDH_EID13_POSITION                            0x5
#define _RXF3EIDH_EID13_SIZE                                0x1
#define _RXF3EIDH_EID13_LENGTH                              0x1
#define _RXF3EIDH_EID13_MASK                                0x20
#define _RXF3EIDH_EID14_POSN                                0x6
#define _RXF3EIDH_EID14_POSITION                            0x6
#define _RXF3EIDH_EID14_SIZE                                0x1
#define _RXF3EIDH_EID14_LENGTH                              0x1
#define _RXF3EIDH_EID14_MASK                                0x40
#define _RXF3EIDH_EID15_POSN                                0x7
#define _RXF3EIDH_EID15_POSITION                            0x7
#define _RXF3EIDH_EID15_SIZE                                0x1
#define _RXF3EIDH_EID15_LENGTH                              0x1
#define _RXF3EIDH_EID15_MASK                                0x80
#define _RXF3EIDH_RXF3EID8_POSN                             0x0
#define _RXF3EIDH_RXF3EID8_POSITION                         0x0
#define _RXF3EIDH_RXF3EID8_SIZE                             0x1
#define _RXF3EIDH_RXF3EID8_LENGTH                           0x1
#define _RXF3EIDH_RXF3EID8_MASK                             0x1
#define _RXF3EIDH_RXF3EID9_POSN                             0x1
#define _RXF3EIDH_RXF3EID9_POSITION                         0x1
#define _RXF3EIDH_RXF3EID9_SIZE                             0x1
#define _RXF3EIDH_RXF3EID9_LENGTH                           0x1
#define _RXF3EIDH_RXF3EID9_MASK                             0x2
#define _RXF3EIDH_RXF3EID10_POSN                            0x2
#define _RXF3EIDH_RXF3EID10_POSITION                        0x2
#define _RXF3EIDH_RXF3EID10_SIZE                            0x1
#define _RXF3EIDH_RXF3EID10_LENGTH                          0x1
#define _RXF3EIDH_RXF3EID10_MASK                            0x4
#define _RXF3EIDH_RXF3EID11_POSN                            0x3
#define _RXF3EIDH_RXF3EID11_POSITION                        0x3
#define _RXF3EIDH_RXF3EID11_SIZE                            0x1
#define _RXF3EIDH_RXF3EID11_LENGTH                          0x1
#define _RXF3EIDH_RXF3EID11_MASK                            0x8
#define _RXF3EIDH_RXF3EID12_POSN                            0x4
#define _RXF3EIDH_RXF3EID12_POSITION                        0x4
#define _RXF3EIDH_RXF3EID12_SIZE                            0x1
#define _RXF3EIDH_RXF3EID12_LENGTH                          0x1
#define _RXF3EIDH_RXF3EID12_MASK                            0x10
#define _RXF3EIDH_RXF3EID13_POSN                            0x5
#define _RXF3EIDH_RXF3EID13_POSITION                        0x5
#define _RXF3EIDH_RXF3EID13_SIZE                            0x1
#define _RXF3EIDH_RXF3EID13_LENGTH                          0x1
#define _RXF3EIDH_RXF3EID13_MASK                            0x20
#define _RXF3EIDH_RXF3EID14_POSN                            0x6
#define _RXF3EIDH_RXF3EID14_POSITION                        0x6
#define _RXF3EIDH_RXF3EID14_SIZE                            0x1
#define _RXF3EIDH_RXF3EID14_LENGTH                          0x1
#define _RXF3EIDH_RXF3EID14_MASK                            0x40
#define _RXF3EIDH_RXF3EID15_POSN                            0x7
#define _RXF3EIDH_RXF3EID15_POSITION                        0x7
#define _RXF3EIDH_RXF3EID15_SIZE                            0x1
#define _RXF3EIDH_RXF3EID15_LENGTH                          0x1
#define _RXF3EIDH_RXF3EID15_MASK                            0x80

// Register: RXF3EIDL
#define RXF3EIDL RXF3EIDL
extern volatile unsigned char           RXF3EIDL            __at(0xF0F);
#ifndef _LIB_BUILD
asm("RXF3EIDL equ 0F0Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID0                   :1;
        unsigned EID1                   :1;
        unsigned EID2                   :1;
        unsigned EID3                   :1;
        unsigned EID4                   :1;
        unsigned EID5                   :1;
        unsigned EID6                   :1;
        unsigned EID7                   :1;
    };
    struct {
        unsigned RXF3EID0               :1;
        unsigned RXF3EID1               :1;
        unsigned RXF3EID2               :1;
        unsigned RXF3EID3               :1;
        unsigned RXF3EID4               :1;
        unsigned RXF3EID5               :1;
        unsigned RXF3EID6               :1;
        unsigned RXF3EID7               :1;
    };
} RXF3EIDLbits_t;
extern volatile RXF3EIDLbits_t RXF3EIDLbits __at(0xF0F);
// bitfield macros
#define _RXF3EIDL_EID0_POSN                                 0x0
#define _RXF3EIDL_EID0_POSITION                             0x0
#define _RXF3EIDL_EID0_SIZE                                 0x1
#define _RXF3EIDL_EID0_LENGTH                               0x1
#define _RXF3EIDL_EID0_MASK                                 0x1
#define _RXF3EIDL_EID1_POSN                                 0x1
#define _RXF3EIDL_EID1_POSITION                             0x1
#define _RXF3EIDL_EID1_SIZE                                 0x1
#define _RXF3EIDL_EID1_LENGTH                               0x1
#define _RXF3EIDL_EID1_MASK                                 0x2
#define _RXF3EIDL_EID2_POSN                                 0x2
#define _RXF3EIDL_EID2_POSITION                             0x2
#define _RXF3EIDL_EID2_SIZE                                 0x1
#define _RXF3EIDL_EID2_LENGTH                               0x1
#define _RXF3EIDL_EID2_MASK                                 0x4
#define _RXF3EIDL_EID3_POSN                                 0x3
#define _RXF3EIDL_EID3_POSITION                             0x3
#define _RXF3EIDL_EID3_SIZE                                 0x1
#define _RXF3EIDL_EID3_LENGTH                               0x1
#define _RXF3EIDL_EID3_MASK                                 0x8
#define _RXF3EIDL_EID4_POSN                                 0x4
#define _RXF3EIDL_EID4_POSITION                             0x4
#define _RXF3EIDL_EID4_SIZE                                 0x1
#define _RXF3EIDL_EID4_LENGTH                               0x1
#define _RXF3EIDL_EID4_MASK                                 0x10
#define _RXF3EIDL_EID5_POSN                                 0x5
#define _RXF3EIDL_EID5_POSITION                             0x5
#define _RXF3EIDL_EID5_SIZE                                 0x1
#define _RXF3EIDL_EID5_LENGTH                               0x1
#define _RXF3EIDL_EID5_MASK                                 0x20
#define _RXF3EIDL_EID6_POSN                                 0x6
#define _RXF3EIDL_EID6_POSITION                             0x6
#define _RXF3EIDL_EID6_SIZE                                 0x1
#define _RXF3EIDL_EID6_LENGTH                               0x1
#define _RXF3EIDL_EID6_MASK                                 0x40
#define _RXF3EIDL_EID7_POSN                                 0x7
#define _RXF3EIDL_EID7_POSITION                             0x7
#define _RXF3EIDL_EID7_SIZE                                 0x1
#define _RXF3EIDL_EID7_LENGTH                               0x1
#define _RXF3EIDL_EID7_MASK                                 0x80
#define _RXF3EIDL_RXF3EID0_POSN                             0x0
#define _RXF3EIDL_RXF3EID0_POSITION                         0x0
#define _RXF3EIDL_RXF3EID0_SIZE                             0x1
#define _RXF3EIDL_RXF3EID0_LENGTH                           0x1
#define _RXF3EIDL_RXF3EID0_MASK                             0x1
#define _RXF3EIDL_RXF3EID1_POSN                             0x1
#define _RXF3EIDL_RXF3EID1_POSITION                         0x1
#define _RXF3EIDL_RXF3EID1_SIZE                             0x1
#define _RXF3EIDL_RXF3EID1_LENGTH                           0x1
#define _RXF3EIDL_RXF3EID1_MASK                             0x2
#define _RXF3EIDL_RXF3EID2_POSN                             0x2
#define _RXF3EIDL_RXF3EID2_POSITION                         0x2
#define _RXF3EIDL_RXF3EID2_SIZE                             0x1
#define _RXF3EIDL_RXF3EID2_LENGTH                           0x1
#define _RXF3EIDL_RXF3EID2_MASK                             0x4
#define _RXF3EIDL_RXF3EID3_POSN                             0x3
#define _RXF3EIDL_RXF3EID3_POSITION                         0x3
#define _RXF3EIDL_RXF3EID3_SIZE                             0x1
#define _RXF3EIDL_RXF3EID3_LENGTH                           0x1
#define _RXF3EIDL_RXF3EID3_MASK                             0x8
#define _RXF3EIDL_RXF3EID4_POSN                             0x4
#define _RXF3EIDL_RXF3EID4_POSITION                         0x4
#define _RXF3EIDL_RXF3EID4_SIZE                             0x1
#define _RXF3EIDL_RXF3EID4_LENGTH                           0x1
#define _RXF3EIDL_RXF3EID4_MASK                             0x10
#define _RXF3EIDL_RXF3EID5_POSN                             0x5
#define _RXF3EIDL_RXF3EID5_POSITION                         0x5
#define _RXF3EIDL_RXF3EID5_SIZE                             0x1
#define _RXF3EIDL_RXF3EID5_LENGTH                           0x1
#define _RXF3EIDL_RXF3EID5_MASK                             0x20
#define _RXF3EIDL_RXF3EID6_POSN                             0x6
#define _RXF3EIDL_RXF3EID6_POSITION                         0x6
#define _RXF3EIDL_RXF3EID6_SIZE                             0x1
#define _RXF3EIDL_RXF3EID6_LENGTH                           0x1
#define _RXF3EIDL_RXF3EID6_MASK                             0x40
#define _RXF3EIDL_RXF3EID7_POSN                             0x7
#define _RXF3EIDL_RXF3EID7_POSITION                         0x7
#define _RXF3EIDL_RXF3EID7_SIZE                             0x1
#define _RXF3EIDL_RXF3EID7_LENGTH                           0x1
#define _RXF3EIDL_RXF3EID7_MASK                             0x80

