MikroElektronika/core_packages/PIC/XC8/def/PIC18F6585/mcu.h
extern volatile __bit                   DC                  __at(0x7EC1);	// @ (0xFD8 * 8 + 1)
#define                                 DC_bit              _BIT_ACCESS(STATUS,1)
// CCP1CON<DC1B0>
extern volatile __bit                   DC1B0               __at(0x7DEC);	// @ (0xFBD * 8 + 4)
#define                                 DC1B0_bit           _BIT_ACCESS(CCP1CON,4)
// CCP1CON<DC1B1>
extern volatile __bit                   DC1B1               __at(0x7DED);	// @ (0xFBD * 8 + 5)
#define                                 DC1B1_bit           _BIT_ACCESS(CCP1CON,5)
// CCP2CON<DC2B0>
extern volatile __bit                   DC2B0               __at(0x7DD4);	// @ (0xFBA * 8 + 4)
#define                                 DC2B0_bit           _BIT_ACCESS(CCP2CON,4)
// CCP2CON<DC2B1>
extern volatile __bit                   DC2B1               __at(0x7DD5);	// @ (0xFBA * 8 + 5)
#define                                 DC2B1_bit           _BIT_ACCESS(CCP2CON,5)
// SDFLC<DFLC0>
extern volatile __bit                   DFLC0               __at(0x6EC0);	// @ (0xDD8 * 8 + 0)
#define                                 DFLC0_bit           _BIT_ACCESS(SDFLC,0)
// SDFLC<DFLC1>
extern volatile __bit                   DFLC1               __at(0x6EC1);	// @ (0xDD8 * 8 + 1)
#define                                 DFLC1_bit           _BIT_ACCESS(SDFLC,1)
// SDFLC<DFLC2>
extern volatile __bit                   DFLC2               __at(0x6EC2);	// @ (0xDD8 * 8 + 2)
#define                                 DFLC2_bit           _BIT_ACCESS(SDFLC,2)
// SDFLC<DFLC3>
extern volatile __bit                   DFLC3               __at(0x6EC3);	// @ (0xDD8 * 8 + 3)
#define                                 DFLC3_bit           _BIT_ACCESS(SDFLC,3)
// SDFLC<DFLC4>
extern volatile __bit                   DFLC4               __at(0x6EC4);	// @ (0xDD8 * 8 + 4)
#define                                 DFLC4_bit           _BIT_ACCESS(SDFLC,4)
// ADCON0<DONE>
extern volatile __bit                   DONE                __at(0x7E11);	// @ (0xFC2 * 8 + 1)
#define                                 DONE_bit            _BIT_ACCESS(ADCON0,1)
// BIE0<DRXB0IE>
extern volatile __bit                   DRXB0IE             __at(0x6FD0);	// @ (0xDFA * 8 + 0)
#define                                 DRXB0IE_bit         _BIT_ACCESS(BIE0,0)
// BIE0<DRXB1IE>
extern volatile __bit                   DRXB1IE             __at(0x6FD1);	// @ (0xDFA * 8 + 1)
#define                                 DRXB1IE_bit         _BIT_ACCESS(BIE0,1)
// PORTC<DT>
extern volatile __bit                   DT                  __at(0x7C17);	// @ (0xF82 * 8 + 7)
#define                                 DT_bit              _BIT_ACCESS(PORTC,7)
// SSPSTAT<D_A>
extern volatile __bit                   D_A                 __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 D_A_bit             _BIT_ACCESS(SSPSTAT,5)
// SSPSTAT<D_NOT_A>
extern volatile __bit                   D_NOT_A             __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 D_NOT_A_bit         _BIT_ACCESS(SSPSTAT,5)
// SSPSTAT<D_nA>
extern volatile __bit                   D_nA                __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 D_nA_bit            _BIT_ACCESS(SSPSTAT,5)
// PR2<EBDIS>
extern volatile __bit                   EBDIS               __at(0x7E5F);	// @ (0xFCB * 8 + 7)
#define                                 EBDIS_bit           _BIT_ACCESS(_PR2,7)  // Note: Changed by MikroE
// ECCP1AS<ECCPAS0>
extern volatile __bit                   ECCPAS0             __at(0x7DB4);	// @ (0xFB6 * 8 + 4)
#define                                 ECCPAS0_bit         _BIT_ACCESS(ECCP1AS,4)
// ECCP1AS<ECCPAS1>
extern volatile __bit                   ECCPAS1             __at(0x7DB5);	// @ (0xFB6 * 8 + 5)
#define                                 ECCPAS1_bit         _BIT_ACCESS(ECCP1AS,5)
// ECCP1AS<ECCPAS2>
extern volatile __bit                   ECCPAS2             __at(0x7DB6);	// @ (0xFB6 * 8 + 6)
#define                                 ECCPAS2_bit         _BIT_ACCESS(ECCP1AS,6)
// ECCP1AS<ECCPASE>
extern volatile __bit                   ECCPASE             __at(0x7DB7);	// @ (0xFB6 * 8 + 7)
#define                                 ECCPASE_bit         _BIT_ACCESS(ECCP1AS,7)
// EECON1<EEFS>
extern volatile __bit                   EEFS                __at(0x7D36);	// @ (0xFA6 * 8 + 6)
#define                                 EEFS_bit            _BIT_ACCESS(EECON1,6)
// PIE2<EEIE>
extern volatile __bit                   EEIE                __at(0x7D04);	// @ (0xFA0 * 8 + 4)
#define                                 EEIE_bit            _BIT_ACCESS(PIE2,4)
// PIR2<EEIF>
extern volatile __bit                   EEIF                __at(0x7D0C);	// @ (0xFA1 * 8 + 4)
#define                                 EEIF_bit            _BIT_ACCESS(PIR2,4)
// IPR2<EEIP>
extern volatile __bit                   EEIP                __at(0x7D14);	// @ (0xFA2 * 8 + 4)
#define                                 EEIP_bit            _BIT_ACCESS(IPR2,4)
// EECON1<EEPGD>
extern volatile __bit                   EEPGD               __at(0x7D37);	// @ (0xFA6 * 8 + 7)
#define                                 EEPGD_bit           _BIT_ACCESS(EECON1,7)
// CANSTAT<EICODE0>
extern volatile __bit _DEPRECATED       EICODE0             __at(0x7B70);	// @ (0xF6E * 8 + 0)
#define                                 EICODE0_bit         _BIT_ACCESS(CANSTAT,0)
// CANSTAT<EICODE1>
extern volatile __bit                   EICODE1             __at(0x7B71);	// @ (0xF6E * 8 + 1)
#define                                 EICODE1_bit         _BIT_ACCESS(CANSTAT,1)
// CANSTAT<EICODE2>
extern volatile __bit                   EICODE2             __at(0x7B72);	// @ (0xF6E * 8 + 2)
#define                                 EICODE2_bit         _BIT_ACCESS(CANSTAT,2)
// CANSTAT<EICODE3>
extern volatile __bit                   EICODE3             __at(0x7B73);	// @ (0xF6E * 8 + 3)
#define                                 EICODE3_bit         _BIT_ACCESS(CANSTAT,3)
// CANSTAT<EICODE4>
extern volatile __bit _DEPRECATED       EICODE4             __at(0x7B74);	// @ (0xF6E * 8 + 4)
#define                                 EICODE4_bit         _BIT_ACCESS(CANSTAT,4)
// CIOCON<ENDRHI>
extern volatile __bit                   ENDRHI              __at(0x7B9D);	// @ (0xF73 * 8 + 5)
#define                                 ENDRHI_bit          _BIT_ACCESS(CIOCON,5)
// PIE3<ERRIE>
extern volatile __bit                   ERRIE               __at(0x7D1D);	// @ (0xFA3 * 8 + 5)
#define                                 ERRIE_bit           _BIT_ACCESS(PIE3,5)
// PIR3<ERRIF>
extern volatile __bit                   ERRIF               __at(0x7D25);	// @ (0xFA4 * 8 + 5)
#define                                 ERRIF_bit           _BIT_ACCESS(PIR3,5)
// IPR3<ERRIP>
extern volatile __bit                   ERRIP               __at(0x7D2D);	// @ (0xFA5 * 8 + 5)
#define                                 ERRIP_bit           _BIT_ACCESS(IPR3,5)
// COMSTAT<EWARN>
extern volatile __bit                   EWARN               __at(0x7BA0);	// @ (0xF74 * 8 + 0)
#define                                 EWARN_bit           _BIT_ACCESS(COMSTAT,0)
// ECANCON<EWIN0>
extern volatile __bit                   EWIN0               __at(0x7BB8);	// @ (0xF77 * 8 + 0)
#define                                 EWIN0_bit           _BIT_ACCESS(ECANCON,0)
// ECANCON<EWIN1>
extern volatile __bit                   EWIN1               __at(0x7BB9);	// @ (0xF77 * 8 + 1)
#define                                 EWIN1_bit           _BIT_ACCESS(ECANCON,1)
// ECANCON<EWIN2>
extern volatile __bit                   EWIN2               __at(0x7BBA);	// @ (0xF77 * 8 + 2)
#define                                 EWIN2_bit           _BIT_ACCESS(ECANCON,2)
// ECANCON<EWIN3>
extern volatile __bit                   EWIN3               __at(0x7BBB);	// @ (0xF77 * 8 + 3)
#define                                 EWIN3_bit           _BIT_ACCESS(ECANCON,3)
// ECANCON<EWIN4>
extern volatile __bit                   EWIN4               __at(0x7BBC);	// @ (0xF77 * 8 + 4)
#define                                 EWIN4_bit           _BIT_ACCESS(ECANCON,4)
// RXM0SIDL<EXIDM>
extern volatile __bit                   EXIDM               __at(0x78CB);	// @ (0xF19 * 8 + 3)
#define                                 EXIDM_bit           _BIT_ACCESS(RXM0SIDL,3)
// RXFBCON0<F0BP_0>
extern volatile __bit                   F0BP_0              __at(0x6F00);	// @ (0xDE0 * 8 + 0)
#define                                 F0BP_0_bit          _BIT_ACCESS(RXFBCON0,0)
// RXFBCON0<F0BP_01>
extern volatile __bit                   F0BP_01             __at(0x6F00);	// @ (0xDE0 * 8 + 0)
#define                                 F0BP_01_bit         _BIT_ACCESS(RXFBCON0,0)
// RXFBCON0<F0BP_1>
extern volatile __bit                   F0BP_1              __at(0x6F01);	// @ (0xDE0 * 8 + 1)
#define                                 F0BP_1_bit          _BIT_ACCESS(RXFBCON0,1)
// RXFBCON0<F0BP_2>
extern volatile __bit                   F0BP_2              __at(0x6F02);	// @ (0xDE0 * 8 + 2)
#define                                 F0BP_2_bit          _BIT_ACCESS(RXFBCON0,2)
// RXFBCON0<F0BP_3>
extern volatile __bit                   F0BP_3              __at(0x6F03);	// @ (0xDE0 * 8 + 3)
#define                                 F0BP_3_bit          _BIT_ACCESS(RXFBCON0,3)
// RXFBCON5<F10BP_0>
extern volatile __bit                   F10BP_0             __at(0x6F28);	// @ (0xDE5 * 8 + 0)
#define                                 F10BP_0_bit         _BIT_ACCESS(RXFBCON5,0)
// RXFBCON5<F10BP_01>
extern volatile __bit                   F10BP_01            __at(0x6F28);	// @ (0xDE5 * 8 + 0)
#define                                 F10BP_01_bit        _BIT_ACCESS(RXFBCON5,0)
// RXFBCON5<F10BP_1>
extern volatile __bit                   F10BP_1             __at(0x6F29);	// @ (0xDE5 * 8 + 1)
#define                                 F10BP_1_bit         _BIT_ACCESS(RXFBCON5,1)
// RXFBCON5<F10BP_2>
extern volatile __bit                   F10BP_2             __at(0x6F2A);	// @ (0xDE5 * 8 + 2)
#define                                 F10BP_2_bit         _BIT_ACCESS(RXFBCON5,2)
// RXFBCON5<F10BP_3>
extern volatile __bit                   F10BP_3             __at(0x6F2B);	// @ (0xDE5 * 8 + 3)
#define                                 F10BP_3_bit         _BIT_ACCESS(RXFBCON5,3)
// RXFBCON5<F11BP_0>
extern volatile __bit                   F11BP_0             __at(0x6F2C);	// @ (0xDE5 * 8 + 4)
#define                                 F11BP_0_bit         _BIT_ACCESS(RXFBCON5,4)
// RXFBCON5<F11BP_1>
extern volatile __bit                   F11BP_1             __at(0x6F2D);	// @ (0xDE5 * 8 + 5)
#define                                 F11BP_1_bit         _BIT_ACCESS(RXFBCON5,5)
// RXFBCON5<F11BP_2>
extern volatile __bit                   F11BP_2             __at(0x6F2E);	// @ (0xDE5 * 8 + 6)
#define                                 F11BP_2_bit         _BIT_ACCESS(RXFBCON5,6)
// RXFBCON5<F11BP_3>
extern volatile __bit                   F11BP_3             __at(0x6F2F);	// @ (0xDE5 * 8 + 7)
#define                                 F11BP_3_bit         _BIT_ACCESS(RXFBCON5,7)
// RXFBCON6<F12BP_0>
extern volatile __bit                   F12BP_0             __at(0x6F30);	// @ (0xDE6 * 8 + 0)
#define                                 F12BP_0_bit         _BIT_ACCESS(RXFBCON6,0)
// RXFBCON6<F12BP_01>
extern volatile __bit                   F12BP_01            __at(0x6F30);	// @ (0xDE6 * 8 + 0)
#define                                 F12BP_01_bit        _BIT_ACCESS(RXFBCON6,0)
// RXFBCON6<F12BP_1>
extern volatile __bit                   F12BP_1             __at(0x6F31);	// @ (0xDE6 * 8 + 1)
#define                                 F12BP_1_bit         _BIT_ACCESS(RXFBCON6,1)
// RXFBCON6<F12BP_2>
extern volatile __bit                   F12BP_2             __at(0x6F32);	// @ (0xDE6 * 8 + 2)
#define                                 F12BP_2_bit         _BIT_ACCESS(RXFBCON6,2)
// RXFBCON6<F12BP_3>
extern volatile __bit                   F12BP_3             __at(0x6F33);	// @ (0xDE6 * 8 + 3)
#define                                 F12BP_3_bit         _BIT_ACCESS(RXFBCON6,3)
// RXFBCON6<F13BP_0>
extern volatile __bit                   F13BP_0             __at(0x6F34);	// @ (0xDE6 * 8 + 4)
#define                                 F13BP_0_bit         _BIT_ACCESS(RXFBCON6,4)
// RXFBCON6<F13BP_1>
extern volatile __bit                   F13BP_1             __at(0x6F35);	// @ (0xDE6 * 8 + 5)
#define                                 F13BP_1_bit         _BIT_ACCESS(RXFBCON6,5)
// RXFBCON6<F13BP_2>
extern volatile __bit                   F13BP_2             __at(0x6F36);	// @ (0xDE6 * 8 + 6)
#define                                 F13BP_2_bit         _BIT_ACCESS(RXFBCON6,6)
// RXFBCON6<F13BP_3>
extern volatile __bit                   F13BP_3             __at(0x6F37);	// @ (0xDE6 * 8 + 7)
#define                                 F13BP_3_bit         _BIT_ACCESS(RXFBCON6,7)
// RXFBCON7<F14BP_0>
extern volatile __bit                   F14BP_0             __at(0x6F38);	// @ (0xDE7 * 8 + 0)
#define                                 F14BP_0_bit         _BIT_ACCESS(RXFBCON7,0)
// RXFBCON7<F14BP_01>
extern volatile __bit                   F14BP_01            __at(0x6F38);	// @ (0xDE7 * 8 + 0)
#define                                 F14BP_01_bit        _BIT_ACCESS(RXFBCON7,0)
// RXFBCON7<F14BP_1>
extern volatile __bit                   F14BP_1             __at(0x6F39);	// @ (0xDE7 * 8 + 1)
#define                                 F14BP_1_bit         _BIT_ACCESS(RXFBCON7,1)
// RXFBCON7<F14BP_2>
extern volatile __bit                   F14BP_2             __at(0x6F3A);	// @ (0xDE7 * 8 + 2)
#define                                 F14BP_2_bit         _BIT_ACCESS(RXFBCON7,2)
// RXFBCON7<F14BP_3>
extern volatile __bit                   F14BP_3             __at(0x6F3B);	// @ (0xDE7 * 8 + 3)
#define                                 F14BP_3_bit         _BIT_ACCESS(RXFBCON7,3)
// RXFBCON7<F15BP_0>
extern volatile __bit                   F15BP_0             __at(0x6F3C);	// @ (0xDE7 * 8 + 4)
#define                                 F15BP_0_bit         _BIT_ACCESS(RXFBCON7,4)
// RXFBCON7<F15BP_1>
extern volatile __bit                   F15BP_1             __at(0x6F3D);	// @ (0xDE7 * 8 + 5)
#define                                 F15BP_1_bit         _BIT_ACCESS(RXFBCON7,5)
// RXFBCON7<F15BP_2>
extern volatile __bit                   F15BP_2             __at(0x6F3E);	// @ (0xDE7 * 8 + 6)
#define                                 F15BP_2_bit         _BIT_ACCESS(RXFBCON7,6)
// RXFBCON7<F15BP_3>
extern volatile __bit                   F15BP_3             __at(0x6F3F);	// @ (0xDE7 * 8 + 7)
#define                                 F15BP_3_bit         _BIT_ACCESS(RXFBCON7,7)
// RXFBCON0<F1BP_0>
extern volatile __bit                   F1BP_0              __at(0x6F04);	// @ (0xDE0 * 8 + 4)
#define                                 F1BP_0_bit          _BIT_ACCESS(RXFBCON0,4)
// RXFBCON0<F1BP_1>
extern volatile __bit                   F1BP_1              __at(0x6F05);	// @ (0xDE0 * 8 + 5)
#define                                 F1BP_1_bit          _BIT_ACCESS(RXFBCON0,5)
// RXFBCON0<F1BP_2>
extern volatile __bit                   F1BP_2              __at(0x6F06);	// @ (0xDE0 * 8 + 6)
#define                                 F1BP_2_bit          _BIT_ACCESS(RXFBCON0,6)
// RXFBCON0<F1BP_3>
extern volatile __bit                   F1BP_3              __at(0x6F07);	// @ (0xDE0 * 8 + 7)
#define                                 F1BP_3_bit          _BIT_ACCESS(RXFBCON0,7)
// RXFBCON1<F2BP_0>
extern volatile __bit                   F2BP_0              __at(0x6F08);	// @ (0xDE1 * 8 + 0)
#define                                 F2BP_0_bit          _BIT_ACCESS(RXFBCON1,0)
// RXFBCON1<F2BP_01>
extern volatile __bit                   F2BP_01             __at(0x6F08);	// @ (0xDE1 * 8 + 0)
#define                                 F2BP_01_bit         _BIT_ACCESS(RXFBCON1,0)
// RXFBCON1<F2BP_1>
extern volatile __bit                   F2BP_1              __at(0x6F09);	// @ (0xDE1 * 8 + 1)
#define                                 F2BP_1_bit          _BIT_ACCESS(RXFBCON1,1)
// RXFBCON1<F2BP_2>
extern volatile __bit                   F2BP_2              __at(0x6F0A);	// @ (0xDE1 * 8 + 2)
#define                                 F2BP_2_bit          _BIT_ACCESS(RXFBCON1,2)
// RXFBCON1<F2BP_3>
extern volatile __bit                   F2BP_3              __at(0x6F0B);	// @ (0xDE1 * 8 + 3)
#define                                 F2BP_3_bit          _BIT_ACCESS(RXFBCON1,3)
// RXFBCON1<F3BP_0>
extern volatile __bit                   F3BP_0              __at(0x6F0C);	// @ (0xDE1 * 8 + 4)
#define                                 F3BP_0_bit          _BIT_ACCESS(RXFBCON1,4)
// RXFBCON1<F3BP_1>
extern volatile __bit                   F3BP_1              __at(0x6F0D);	// @ (0xDE1 * 8 + 5)
#define                                 F3BP_1_bit          _BIT_ACCESS(RXFBCON1,5)
// RXFBCON1<F3BP_2>
extern volatile __bit                   F3BP_2              __at(0x6F0E);	// @ (0xDE1 * 8 + 6)
#define                                 F3BP_2_bit          _BIT_ACCESS(RXFBCON1,6)
// RXFBCON1<F3BP_3>
extern volatile __bit                   F3BP_3              __at(0x6F0F);	// @ (0xDE1 * 8 + 7)
#define                                 F3BP_3_bit          _BIT_ACCESS(RXFBCON1,7)
// RXFBCON2<F4BP_0>
extern volatile __bit                   F4BP_0              __at(0x6F10);	// @ (0xDE2 * 8 + 0)
#define                                 F4BP_0_bit          _BIT_ACCESS(RXFBCON2,0)
// RXFBCON2<F4BP_01>
extern volatile __bit                   F4BP_01             __at(0x6F10);	// @ (0xDE2 * 8 + 0)
#define                                 F4BP_01_bit         _BIT_ACCESS(RXFBCON2,0)
// RXFBCON2<F4BP_1>
extern volatile __bit                   F4BP_1              __at(0x6F11);	// @ (0xDE2 * 8 + 1)
#define                                 F4BP_1_bit          _BIT_ACCESS(RXFBCON2,1)
// RXFBCON2<F4BP_2>
extern volatile __bit                   F4BP_2              __at(0x6F12);	// @ (0xDE2 * 8 + 2)
#define                                 F4BP_2_bit          _BIT_ACCESS(RXFBCON2,2)
// RXFBCON2<F4BP_3>
extern volatile __bit                   F4BP_3              __at(0x6F13);	// @ (0xDE2 * 8 + 3)
#define                                 F4BP_3_bit          _BIT_ACCESS(RXFBCON2,3)
// RXFBCON2<F5BP_0>
extern volatile __bit                   F5BP_0              __at(0x6F14);	// @ (0xDE2 * 8 + 4)
#define                                 F5BP_0_bit          _BIT_ACCESS(RXFBCON2,4)
// RXFBCON2<F5BP_1>
extern volatile __bit                   F5BP_1              __at(0x6F15);	// @ (0xDE2 * 8 + 5)
#define                                 F5BP_1_bit          _BIT_ACCESS(RXFBCON2,5)
// RXFBCON2<F5BP_2>
extern volatile __bit                   F5BP_2              __at(0x6F16);	// @ (0xDE2 * 8 + 6)
#define                                 F5BP_2_bit          _BIT_ACCESS(RXFBCON2,6)
// RXFBCON2<F5BP_3>
extern volatile __bit                   F5BP_3              __at(0x6F17);	// @ (0xDE2 * 8 + 7)
#define                                 F5BP_3_bit          _BIT_ACCESS(RXFBCON2,7)
// RXFBCON3<F6BP_0>
extern volatile __bit                   F6BP_0              __at(0x6F18);	// @ (0xDE3 * 8 + 0)
#define                                 F6BP_0_bit          _BIT_ACCESS(RXFBCON3,0)
// RXFBCON3<F6BP_01>
extern volatile __bit                   F6BP_01             __at(0x6F18);	// @ (0xDE3 * 8 + 0)
#define                                 F6BP_01_bit         _BIT_ACCESS(RXFBCON3,0)
// RXFBCON3<F6BP_1>
extern volatile __bit                   F6BP_1              __at(0x6F19);	// @ (0xDE3 * 8 + 1)
#define                                 F6BP_1_bit          _BIT_ACCESS(RXFBCON3,1)
// RXFBCON3<F6BP_2>
extern volatile __bit                   F6BP_2              __at(0x6F1A);	// @ (0xDE3 * 8 + 2)
#define                                 F6BP_2_bit          _BIT_ACCESS(RXFBCON3,2)
// RXFBCON3<F6BP_3>
extern volatile __bit                   F6BP_3              __at(0x6F1B);	// @ (0xDE3 * 8 + 3)
#define                                 F6BP_3_bit          _BIT_ACCESS(RXFBCON3,3)
// RXFBCON3<F7BP_0>
extern volatile __bit                   F7BP_0              __at(0x6F1C);	// @ (0xDE3 * 8 + 4)
#define                                 F7BP_0_bit          _BIT_ACCESS(RXFBCON3,4)
// RXFBCON3<F7BP_1>
extern volatile __bit                   F7BP_1              __at(0x6F1D);	// @ (0xDE3 * 8 + 5)
#define                                 F7BP_1_bit          _BIT_ACCESS(RXFBCON3,5)
// RXFBCON3<F7BP_2>
extern volatile __bit                   F7BP_2              __at(0x6F1E);	// @ (0xDE3 * 8 + 6)
#define                                 F7BP_2_bit          _BIT_ACCESS(RXFBCON3,6)
// RXFBCON3<F7BP_3>
extern volatile __bit                   F7BP_3              __at(0x6F1F);	// @ (0xDE3 * 8 + 7)
#define                                 F7BP_3_bit          _BIT_ACCESS(RXFBCON3,7)
// RXFBCON4<F8BP_0>
extern volatile __bit                   F8BP_0              __at(0x6F20);	// @ (0xDE4 * 8 + 0)
#define                                 F8BP_0_bit          _BIT_ACCESS(RXFBCON4,0)
// RXFBCON4<F8BP_01>
extern volatile __bit                   F8BP_01             __at(0x6F20);	// @ (0xDE4 * 8 + 0)
#define                                 F8BP_01_bit         _BIT_ACCESS(RXFBCON4,0)
// RXFBCON4<F8BP_1>
extern volatile __bit                   F8BP_1              __at(0x6F21);	// @ (0xDE4 * 8 + 1)
#define                                 F8BP_1_bit          _BIT_ACCESS(RXFBCON4,1)
// RXFBCON4<F8BP_2>
extern volatile __bit                   F8BP_2              __at(0x6F22);	// @ (0xDE4 * 8 + 2)
#define                                 F8BP_2_bit          _BIT_ACCESS(RXFBCON4,2)
// RXFBCON4<F8BP_3>
extern volatile __bit                   F8BP_3              __at(0x6F23);	// @ (0xDE4 * 8 + 3)
#define                                 F8BP_3_bit          _BIT_ACCESS(RXFBCON4,3)
// RXFBCON4<F9BP_0>
extern volatile __bit                   F9BP_0              __at(0x6F24);	// @ (0xDE4 * 8 + 4)
#define                                 F9BP_0_bit          _BIT_ACCESS(RXFBCON4,4)
// RXFBCON4<F9BP_1>
extern volatile __bit                   F9BP_1              __at(0x6F25);	// @ (0xDE4 * 8 + 5)
#define                                 F9BP_1_bit          _BIT_ACCESS(RXFBCON4,5)
// RXFBCON4<F9BP_2>
extern volatile __bit                   F9BP_2              __at(0x6F26);	// @ (0xDE4 * 8 + 6)
#define                                 F9BP_2_bit          _BIT_ACCESS(RXFBCON4,6)
// RXFBCON4<F9BP_3>
extern volatile __bit                   F9BP_3              __at(0x6F27);	// @ (0xDE4 * 8 + 7)
#define                                 F9BP_3_bit          _BIT_ACCESS(RXFBCON4,7)
// RCSTA<FERR>
extern volatile __bit                   FERR                __at(0x7D5A);	// @ (0xFAB * 8 + 2)
#define                                 FERR_bit            _BIT_ACCESS(RCSTA,2)
// RCSTA<FERR1>
extern volatile __bit                   FERR1               __at(0x7D5A);	// @ (0xFAB * 8 + 2)
#define                                 FERR1_bit           _BIT_ACCESS(RCSTA,2)
// COMSTAT<FIFOEMPTY>
extern volatile __bit                   FIFOEMPTY           __at(0x7BA7);	// @ (0xF74 * 8 + 7)
#define                                 FIFOEMPTY_bit       _BIT_ACCESS(COMSTAT,7)
// ECANCON<FIFOWM>
extern volatile __bit                   FIFOWM              __at(0x7BBD);	// @ (0xF77 * 8 + 5)
#define                                 FIFOWM_bit          _BIT_ACCESS(ECANCON,5)
// PIE3<FIFOWMIE>
extern volatile __bit                   FIFOWMIE            __at(0x7D18);	// @ (0xFA3 * 8 + 0)
#define                                 FIFOWMIE_bit        _BIT_ACCESS(PIE3,0)
// PIR3<FIFOWMIF>
extern volatile __bit                   FIFOWMIF            __at(0x7D20);	// @ (0xFA4 * 8 + 0)
#define                                 FIFOWMIF_bit        _BIT_ACCESS(PIR3,0)
// IPR3<FIFOWMIP>
