MikroElektronika/core_packages/PIC/XC8/def/PIC18F6585/mcu.h
#define                                 RXF4SID7_bit        _BIT_ACCESS(RXF4SIDH,4)
// RXF4SIDH<RXF4SID8>
extern volatile __bit                   RXF4SID8            __at(0x7885);	// @ (0xF10 * 8 + 5)
#define                                 RXF4SID8_bit        _BIT_ACCESS(RXF4SIDH,5)
// RXF4SIDH<RXF4SID9>
extern volatile __bit                   RXF4SID9            __at(0x7886);	// @ (0xF10 * 8 + 6)
#define                                 RXF4SID9_bit        _BIT_ACCESS(RXF4SIDH,6)
// RXF5EIDL<RXF5EID0>
extern volatile __bit                   RXF5EID0            __at(0x78B8);	// @ (0xF17 * 8 + 0)
#define                                 RXF5EID0_bit        _BIT_ACCESS(RXF5EIDL,0)
// RXF5EIDL<RXF5EID1>
extern volatile __bit                   RXF5EID1            __at(0x78B9);	// @ (0xF17 * 8 + 1)
#define                                 RXF5EID1_bit        _BIT_ACCESS(RXF5EIDL,1)
// RXF5EIDH<RXF5EID10>
extern volatile __bit                   RXF5EID10           __at(0x78B2);	// @ (0xF16 * 8 + 2)
#define                                 RXF5EID10_bit       _BIT_ACCESS(RXF5EIDH,2)
// RXF5EIDH<RXF5EID11>
extern volatile __bit                   RXF5EID11           __at(0x78B3);	// @ (0xF16 * 8 + 3)
#define                                 RXF5EID11_bit       _BIT_ACCESS(RXF5EIDH,3)
// RXF5EIDH<RXF5EID12>
extern volatile __bit                   RXF5EID12           __at(0x78B4);	// @ (0xF16 * 8 + 4)
#define                                 RXF5EID12_bit       _BIT_ACCESS(RXF5EIDH,4)
// RXF5EIDH<RXF5EID13>
extern volatile __bit                   RXF5EID13           __at(0x78B5);	// @ (0xF16 * 8 + 5)
#define                                 RXF5EID13_bit       _BIT_ACCESS(RXF5EIDH,5)
// RXF5EIDH<RXF5EID14>
extern volatile __bit                   RXF5EID14           __at(0x78B6);	// @ (0xF16 * 8 + 6)
#define                                 RXF5EID14_bit       _BIT_ACCESS(RXF5EIDH,6)
// RXF5EIDH<RXF5EID15>
extern volatile __bit                   RXF5EID15           __at(0x78B7);	// @ (0xF16 * 8 + 7)
#define                                 RXF5EID15_bit       _BIT_ACCESS(RXF5EIDH,7)
// RXF5SIDL<RXF5EID16>
extern volatile __bit                   RXF5EID16           __at(0x78A8);	// @ (0xF15 * 8 + 0)
#define                                 RXF5EID16_bit       _BIT_ACCESS(RXF5SIDL,0)
// RXF5SIDL<RXF5EID17>
extern volatile __bit                   RXF5EID17           __at(0x78A9);	// @ (0xF15 * 8 + 1)
#define                                 RXF5EID17_bit       _BIT_ACCESS(RXF5SIDL,1)
// RXF5EIDL<RXF5EID2>
extern volatile __bit                   RXF5EID2            __at(0x78BA);	// @ (0xF17 * 8 + 2)
#define                                 RXF5EID2_bit        _BIT_ACCESS(RXF5EIDL,2)
// RXF5EIDL<RXF5EID3>
extern volatile __bit                   RXF5EID3            __at(0x78BB);	// @ (0xF17 * 8 + 3)
#define                                 RXF5EID3_bit        _BIT_ACCESS(RXF5EIDL,3)
// RXF5EIDL<RXF5EID4>
extern volatile __bit                   RXF5EID4            __at(0x78BC);	// @ (0xF17 * 8 + 4)
#define                                 RXF5EID4_bit        _BIT_ACCESS(RXF5EIDL,4)
// RXF5EIDL<RXF5EID5>
extern volatile __bit                   RXF5EID5            __at(0x78BD);	// @ (0xF17 * 8 + 5)
#define                                 RXF5EID5_bit        _BIT_ACCESS(RXF5EIDL,5)
// RXF5EIDL<RXF5EID6>
extern volatile __bit                   RXF5EID6            __at(0x78BE);	// @ (0xF17 * 8 + 6)
#define                                 RXF5EID6_bit        _BIT_ACCESS(RXF5EIDL,6)
// RXF5EIDL<RXF5EID7>
extern volatile __bit                   RXF5EID7            __at(0x78BF);	// @ (0xF17 * 8 + 7)
#define                                 RXF5EID7_bit        _BIT_ACCESS(RXF5EIDL,7)
// RXF5EIDH<RXF5EID8>
extern volatile __bit                   RXF5EID8            __at(0x78B0);	// @ (0xF16 * 8 + 0)
#define                                 RXF5EID8_bit        _BIT_ACCESS(RXF5EIDH,0)
// RXF5EIDH<RXF5EID9>
extern volatile __bit                   RXF5EID9            __at(0x78B1);	// @ (0xF16 * 8 + 1)
#define                                 RXF5EID9_bit        _BIT_ACCESS(RXF5EIDH,1)
// RXFCON0<RXF5EN>
extern volatile __bit                   RXF5EN              __at(0x6EA5);	// @ (0xDD4 * 8 + 5)
#define                                 RXF5EN_bit          _BIT_ACCESS(RXFCON0,5)
// RXF5SIDL<RXF5EXIDEN>
extern volatile __bit                   RXF5EXIDEN          __at(0x78AB);	// @ (0xF15 * 8 + 3)
#define                                 RXF5EXIDEN_bit      _BIT_ACCESS(RXF5SIDL,3)
// RXF5SIDL<RXF5SID0>
extern volatile __bit                   RXF5SID0            __at(0x78AD);	// @ (0xF15 * 8 + 5)
#define                                 RXF5SID0_bit        _BIT_ACCESS(RXF5SIDL,5)
// RXF5SIDL<RXF5SID1>
extern volatile __bit                   RXF5SID1            __at(0x78AE);	// @ (0xF15 * 8 + 6)
#define                                 RXF5SID1_bit        _BIT_ACCESS(RXF5SIDL,6)
// RXF5SIDH<RXF5SID10>
extern volatile __bit                   RXF5SID10           __at(0x78A7);	// @ (0xF14 * 8 + 7)
#define                                 RXF5SID10_bit       _BIT_ACCESS(RXF5SIDH,7)
// RXF5SIDL<RXF5SID2>
extern volatile __bit                   RXF5SID2            __at(0x78AF);	// @ (0xF15 * 8 + 7)
#define                                 RXF5SID2_bit        _BIT_ACCESS(RXF5SIDL,7)
// RXF5SIDH<RXF5SID3>
extern volatile __bit                   RXF5SID3            __at(0x78A0);	// @ (0xF14 * 8 + 0)
#define                                 RXF5SID3_bit        _BIT_ACCESS(RXF5SIDH,0)
// RXF5SIDH<RXF5SID4>
extern volatile __bit                   RXF5SID4            __at(0x78A1);	// @ (0xF14 * 8 + 1)
#define                                 RXF5SID4_bit        _BIT_ACCESS(RXF5SIDH,1)
// RXF5SIDH<RXF5SID5>
extern volatile __bit                   RXF5SID5            __at(0x78A2);	// @ (0xF14 * 8 + 2)
#define                                 RXF5SID5_bit        _BIT_ACCESS(RXF5SIDH,2)
// RXF5SIDH<RXF5SID6>
extern volatile __bit                   RXF5SID6            __at(0x78A3);	// @ (0xF14 * 8 + 3)
#define                                 RXF5SID6_bit        _BIT_ACCESS(RXF5SIDH,3)
// RXF5SIDH<RXF5SID7>
extern volatile __bit                   RXF5SID7            __at(0x78A4);	// @ (0xF14 * 8 + 4)
#define                                 RXF5SID7_bit        _BIT_ACCESS(RXF5SIDH,4)
// RXF5SIDH<RXF5SID8>
extern volatile __bit                   RXF5SID8            __at(0x78A5);	// @ (0xF14 * 8 + 5)
#define                                 RXF5SID8_bit        _BIT_ACCESS(RXF5SIDH,5)
// RXF5SIDH<RXF5SID9>
extern volatile __bit                   RXF5SID9            __at(0x78A6);	// @ (0xF14 * 8 + 6)
#define                                 RXF5SID9_bit        _BIT_ACCESS(RXF5SIDH,6)
// RXF6EIDL<RXF6EID0>
extern volatile __bit                   RXF6EID0            __at(0x6B18);	// @ (0xD63 * 8 + 0)
#define                                 RXF6EID0_bit        _BIT_ACCESS(RXF6EIDL,0)
// RXF6EIDL<RXF6EID1>
extern volatile __bit                   RXF6EID1            __at(0x6B19);	// @ (0xD63 * 8 + 1)
#define                                 RXF6EID1_bit        _BIT_ACCESS(RXF6EIDL,1)
// RXF6EIDH<RXF6EID10>
extern volatile __bit                   RXF6EID10           __at(0x6B12);	// @ (0xD62 * 8 + 2)
#define                                 RXF6EID10_bit       _BIT_ACCESS(RXF6EIDH,2)
// RXF6EIDH<RXF6EID11>
extern volatile __bit                   RXF6EID11           __at(0x6B13);	// @ (0xD62 * 8 + 3)
#define                                 RXF6EID11_bit       _BIT_ACCESS(RXF6EIDH,3)
// RXF6EIDH<RXF6EID12>
extern volatile __bit                   RXF6EID12           __at(0x6B14);	// @ (0xD62 * 8 + 4)
#define                                 RXF6EID12_bit       _BIT_ACCESS(RXF6EIDH,4)
// RXF6EIDH<RXF6EID13>
extern volatile __bit                   RXF6EID13           __at(0x6B15);	// @ (0xD62 * 8 + 5)
#define                                 RXF6EID13_bit       _BIT_ACCESS(RXF6EIDH,5)
// RXF6EIDH<RXF6EID14>
extern volatile __bit                   RXF6EID14           __at(0x6B16);	// @ (0xD62 * 8 + 6)
#define                                 RXF6EID14_bit       _BIT_ACCESS(RXF6EIDH,6)
// RXF6EIDH<RXF6EID15>
extern volatile __bit                   RXF6EID15           __at(0x6B17);	// @ (0xD62 * 8 + 7)
#define                                 RXF6EID15_bit       _BIT_ACCESS(RXF6EIDH,7)
// RXF6SIDL<RXF6EID16>
extern volatile __bit                   RXF6EID16           __at(0x6B08);	// @ (0xD61 * 8 + 0)
#define                                 RXF6EID16_bit       _BIT_ACCESS(RXF6SIDL,0)
// RXF6SIDL<RXF6EID17>
extern volatile __bit                   RXF6EID17           __at(0x6B09);	// @ (0xD61 * 8 + 1)
#define                                 RXF6EID17_bit       _BIT_ACCESS(RXF6SIDL,1)
// RXF6EIDL<RXF6EID2>
extern volatile __bit                   RXF6EID2            __at(0x6B1A);	// @ (0xD63 * 8 + 2)
#define                                 RXF6EID2_bit        _BIT_ACCESS(RXF6EIDL,2)
// RXF6EIDL<RXF6EID3>
extern volatile __bit                   RXF6EID3            __at(0x6B1B);	// @ (0xD63 * 8 + 3)
#define                                 RXF6EID3_bit        _BIT_ACCESS(RXF6EIDL,3)
// RXF6EIDL<RXF6EID4>
extern volatile __bit                   RXF6EID4            __at(0x6B1C);	// @ (0xD63 * 8 + 4)
#define                                 RXF6EID4_bit        _BIT_ACCESS(RXF6EIDL,4)
// RXF6EIDL<RXF6EID5>
extern volatile __bit                   RXF6EID5            __at(0x6B1D);	// @ (0xD63 * 8 + 5)
#define                                 RXF6EID5_bit        _BIT_ACCESS(RXF6EIDL,5)
// RXF6EIDL<RXF6EID6>
extern volatile __bit                   RXF6EID6            __at(0x6B1E);	// @ (0xD63 * 8 + 6)
#define                                 RXF6EID6_bit        _BIT_ACCESS(RXF6EIDL,6)
// RXF6EIDL<RXF6EID7>
extern volatile __bit                   RXF6EID7            __at(0x6B1F);	// @ (0xD63 * 8 + 7)
#define                                 RXF6EID7_bit        _BIT_ACCESS(RXF6EIDL,7)
// RXF6EIDH<RXF6EID8>
extern volatile __bit                   RXF6EID8            __at(0x6B10);	// @ (0xD62 * 8 + 0)
#define                                 RXF6EID8_bit        _BIT_ACCESS(RXF6EIDH,0)
// RXF6EIDH<RXF6EID9>
extern volatile __bit                   RXF6EID9            __at(0x6B11);	// @ (0xD62 * 8 + 1)
#define                                 RXF6EID9_bit        _BIT_ACCESS(RXF6EIDH,1)
// RXFCON0<RXF6EN>
extern volatile __bit                   RXF6EN              __at(0x6EA6);	// @ (0xDD4 * 8 + 6)
#define                                 RXF6EN_bit          _BIT_ACCESS(RXFCON0,6)
// RXF6SIDL<RXF6EXIDEN>
extern volatile __bit                   RXF6EXIDEN          __at(0x6B0B);	// @ (0xD61 * 8 + 3)
#define                                 RXF6EXIDEN_bit      _BIT_ACCESS(RXF6SIDL,3)
// RXF6SIDL<RXF6SID0>
extern volatile __bit                   RXF6SID0            __at(0x6B0D);	// @ (0xD61 * 8 + 5)
#define                                 RXF6SID0_bit        _BIT_ACCESS(RXF6SIDL,5)
// RXF6SIDL<RXF6SID1>
extern volatile __bit                   RXF6SID1            __at(0x6B0E);	// @ (0xD61 * 8 + 6)
#define                                 RXF6SID1_bit        _BIT_ACCESS(RXF6SIDL,6)
// RXF6SIDH<RXF6SID10>
extern volatile __bit                   RXF6SID10           __at(0x6B07);	// @ (0xD60 * 8 + 7)
#define                                 RXF6SID10_bit       _BIT_ACCESS(RXF6SIDH,7)
// RXF6SIDL<RXF6SID2>
extern volatile __bit                   RXF6SID2            __at(0x6B0F);	// @ (0xD61 * 8 + 7)
#define                                 RXF6SID2_bit        _BIT_ACCESS(RXF6SIDL,7)
// RXF6SIDH<RXF6SID3>
extern volatile __bit                   RXF6SID3            __at(0x6B00);	// @ (0xD60 * 8 + 0)
#define                                 RXF6SID3_bit        _BIT_ACCESS(RXF6SIDH,0)
// RXF6SIDH<RXF6SID4>
extern volatile __bit                   RXF6SID4            __at(0x6B01);	// @ (0xD60 * 8 + 1)
#define                                 RXF6SID4_bit        _BIT_ACCESS(RXF6SIDH,1)
// RXF6SIDH<RXF6SID5>
extern volatile __bit                   RXF6SID5            __at(0x6B02);	// @ (0xD60 * 8 + 2)
#define                                 RXF6SID5_bit        _BIT_ACCESS(RXF6SIDH,2)
// RXF6SIDH<RXF6SID6>
extern volatile __bit                   RXF6SID6            __at(0x6B03);	// @ (0xD60 * 8 + 3)
#define                                 RXF6SID6_bit        _BIT_ACCESS(RXF6SIDH,3)
// RXF6SIDH<RXF6SID7>
extern volatile __bit                   RXF6SID7            __at(0x6B04);	// @ (0xD60 * 8 + 4)
#define                                 RXF6SID7_bit        _BIT_ACCESS(RXF6SIDH,4)
// RXF6SIDH<RXF6SID8>
extern volatile __bit                   RXF6SID8            __at(0x6B05);	// @ (0xD60 * 8 + 5)
#define                                 RXF6SID8_bit        _BIT_ACCESS(RXF6SIDH,5)
// RXF6SIDH<RXF6SID9>
extern volatile __bit                   RXF6SID9            __at(0x6B06);	// @ (0xD60 * 8 + 6)
#define                                 RXF6SID9_bit        _BIT_ACCESS(RXF6SIDH,6)
// RXF7EIDL<RXF7EID0>
extern volatile __bit                   RXF7EID0            __at(0x6B38);	// @ (0xD67 * 8 + 0)
#define                                 RXF7EID0_bit        _BIT_ACCESS(RXF7EIDL,0)
// RXF7EIDL<RXF7EID1>
extern volatile __bit                   RXF7EID1            __at(0x6B39);	// @ (0xD67 * 8 + 1)
#define                                 RXF7EID1_bit        _BIT_ACCESS(RXF7EIDL,1)
// RXF7EIDH<RXF7EID10>
extern volatile __bit                   RXF7EID10           __at(0x6B32);	// @ (0xD66 * 8 + 2)
#define                                 RXF7EID10_bit       _BIT_ACCESS(RXF7EIDH,2)
// RXF7EIDH<RXF7EID11>
extern volatile __bit                   RXF7EID11           __at(0x6B33);	// @ (0xD66 * 8 + 3)
#define                                 RXF7EID11_bit       _BIT_ACCESS(RXF7EIDH,3)
// RXF7EIDH<RXF7EID12>
extern volatile __bit                   RXF7EID12           __at(0x6B34);	// @ (0xD66 * 8 + 4)
#define                                 RXF7EID12_bit       _BIT_ACCESS(RXF7EIDH,4)
// RXF7EIDH<RXF7EID13>
extern volatile __bit                   RXF7EID13           __at(0x6B35);	// @ (0xD66 * 8 + 5)
#define                                 RXF7EID13_bit       _BIT_ACCESS(RXF7EIDH,5)
// RXF7EIDH<RXF7EID14>
extern volatile __bit                   RXF7EID14           __at(0x6B36);	// @ (0xD66 * 8 + 6)
#define                                 RXF7EID14_bit       _BIT_ACCESS(RXF7EIDH,6)
// RXF7EIDH<RXF7EID15>
extern volatile __bit                   RXF7EID15           __at(0x6B37);	// @ (0xD66 * 8 + 7)
#define                                 RXF7EID15_bit       _BIT_ACCESS(RXF7EIDH,7)
// RXF7SIDL<RXF7EID16>
extern volatile __bit                   RXF7EID16           __at(0x6B28);	// @ (0xD65 * 8 + 0)
#define                                 RXF7EID16_bit       _BIT_ACCESS(RXF7SIDL,0)
// RXF7SIDL<RXF7EID17>
extern volatile __bit                   RXF7EID17           __at(0x6B29);	// @ (0xD65 * 8 + 1)
#define                                 RXF7EID17_bit       _BIT_ACCESS(RXF7SIDL,1)
// RXF7EIDL<RXF7EID2>
extern volatile __bit                   RXF7EID2            __at(0x6B3A);	// @ (0xD67 * 8 + 2)
#define                                 RXF7EID2_bit        _BIT_ACCESS(RXF7EIDL,2)
// RXF7EIDL<RXF7EID3>
extern volatile __bit                   RXF7EID3            __at(0x6B3B);	// @ (0xD67 * 8 + 3)
#define                                 RXF7EID3_bit        _BIT_ACCESS(RXF7EIDL,3)
// RXF7EIDL<RXF7EID4>
extern volatile __bit                   RXF7EID4            __at(0x6B3C);	// @ (0xD67 * 8 + 4)
#define                                 RXF7EID4_bit        _BIT_ACCESS(RXF7EIDL,4)
// RXF7EIDL<RXF7EID5>
extern volatile __bit                   RXF7EID5            __at(0x6B3D);	// @ (0xD67 * 8 + 5)
#define                                 RXF7EID5_bit        _BIT_ACCESS(RXF7EIDL,5)
// RXF7EIDL<RXF7EID6>
extern volatile __bit                   RXF7EID6            __at(0x6B3E);	// @ (0xD67 * 8 + 6)
#define                                 RXF7EID6_bit        _BIT_ACCESS(RXF7EIDL,6)
// RXF7EIDL<RXF7EID7>
extern volatile __bit                   RXF7EID7            __at(0x6B3F);	// @ (0xD67 * 8 + 7)
#define                                 RXF7EID7_bit        _BIT_ACCESS(RXF7EIDL,7)
// RXF7EIDH<RXF7EID8>
extern volatile __bit                   RXF7EID8            __at(0x6B30);	// @ (0xD66 * 8 + 0)
#define                                 RXF7EID8_bit        _BIT_ACCESS(RXF7EIDH,0)
// RXF7EIDH<RXF7EID9>
extern volatile __bit                   RXF7EID9            __at(0x6B31);	// @ (0xD66 * 8 + 1)
#define                                 RXF7EID9_bit        _BIT_ACCESS(RXF7EIDH,1)
// RXFCON0<RXF7EN>
extern volatile __bit                   RXF7EN              __at(0x6EA7);	// @ (0xDD4 * 8 + 7)
#define                                 RXF7EN_bit          _BIT_ACCESS(RXFCON0,7)
// RXF7SIDL<RXF7EXIDEN>
extern volatile __bit                   RXF7EXIDEN          __at(0x6B2B);	// @ (0xD65 * 8 + 3)
#define                                 RXF7EXIDEN_bit      _BIT_ACCESS(RXF7SIDL,3)
// RXF7SIDL<RXF7SID0>
extern volatile __bit                   RXF7SID0            __at(0x6B2D);	// @ (0xD65 * 8 + 5)
#define                                 RXF7SID0_bit        _BIT_ACCESS(RXF7SIDL,5)
// RXF7SIDL<RXF7SID1>
extern volatile __bit                   RXF7SID1            __at(0x6B2E);	// @ (0xD65 * 8 + 6)
#define                                 RXF7SID1_bit        _BIT_ACCESS(RXF7SIDL,6)
// RXF7SIDH<RXF7SID10>
extern volatile __bit                   RXF7SID10           __at(0x6B27);	// @ (0xD64 * 8 + 7)
#define                                 RXF7SID10_bit       _BIT_ACCESS(RXF7SIDH,7)
// RXF7SIDL<RXF7SID2>
extern volatile __bit                   RXF7SID2            __at(0x6B2F);	// @ (0xD65 * 8 + 7)
#define                                 RXF7SID2_bit        _BIT_ACCESS(RXF7SIDL,7)
// RXF7SIDH<RXF7SID3>
extern volatile __bit                   RXF7SID3            __at(0x6B20);	// @ (0xD64 * 8 + 0)
#define                                 RXF7SID3_bit        _BIT_ACCESS(RXF7SIDH,0)
// RXF7SIDH<RXF7SID4>
extern volatile __bit                   RXF7SID4            __at(0x6B21);	// @ (0xD64 * 8 + 1)
#define                                 RXF7SID4_bit        _BIT_ACCESS(RXF7SIDH,1)
// RXF7SIDH<RXF7SID5>
extern volatile __bit                   RXF7SID5            __at(0x6B22);	// @ (0xD64 * 8 + 2)
#define                                 RXF7SID5_bit        _BIT_ACCESS(RXF7SIDH,2)
// RXF7SIDH<RXF7SID6>
extern volatile __bit                   RXF7SID6            __at(0x6B23);	// @ (0xD64 * 8 + 3)
#define                                 RXF7SID6_bit        _BIT_ACCESS(RXF7SIDH,3)
// RXF7SIDH<RXF7SID7>
extern volatile __bit                   RXF7SID7            __at(0x6B24);	// @ (0xD64 * 8 + 4)
#define                                 RXF7SID7_bit        _BIT_ACCESS(RXF7SIDH,4)
// RXF7SIDH<RXF7SID8>
extern volatile __bit                   RXF7SID8            __at(0x6B25);	// @ (0xD64 * 8 + 5)
#define                                 RXF7SID8_bit        _BIT_ACCESS(RXF7SIDH,5)
// RXF7SIDH<RXF7SID9>
extern volatile __bit                   RXF7SID9            __at(0x6B26);	// @ (0xD64 * 8 + 6)
#define                                 RXF7SID9_bit        _BIT_ACCESS(RXF7SIDH,6)
// RXF8EIDL<RXF8EID0>
extern volatile __bit                   RXF8EID0            __at(0x6B58);	// @ (0xD6B * 8 + 0)
#define                                 RXF8EID0_bit        _BIT_ACCESS(RXF8EIDL,0)
// RXF8EIDL<RXF8EID1>
extern volatile __bit                   RXF8EID1            __at(0x6B59);	// @ (0xD6B * 8 + 1)
#define                                 RXF8EID1_bit        _BIT_ACCESS(RXF8EIDL,1)
// RXF8EIDH<RXF8EID10>
extern volatile __bit                   RXF8EID10           __at(0x6B52);	// @ (0xD6A * 8 + 2)
#define                                 RXF8EID10_bit       _BIT_ACCESS(RXF8EIDH,2)
// RXF8EIDH<RXF8EID11>
extern volatile __bit                   RXF8EID11           __at(0x6B53);	// @ (0xD6A * 8 + 3)
#define                                 RXF8EID11_bit       _BIT_ACCESS(RXF8EIDH,3)
// RXF8EIDH<RXF8EID12>
extern volatile __bit                   RXF8EID12           __at(0x6B54);	// @ (0xD6A * 8 + 4)
#define                                 RXF8EID12_bit       _BIT_ACCESS(RXF8EIDH,4)
// RXF8EIDH<RXF8EID13>
extern volatile __bit                   RXF8EID13           __at(0x6B55);	// @ (0xD6A * 8 + 5)
#define                                 RXF8EID13_bit       _BIT_ACCESS(RXF8EIDH,5)
// RXF8EIDH<RXF8EID14>
extern volatile __bit                   RXF8EID14           __at(0x6B56);	// @ (0xD6A * 8 + 6)
#define                                 RXF8EID14_bit       _BIT_ACCESS(RXF8EIDH,6)
// RXF8EIDH<RXF8EID15>
extern volatile __bit                   RXF8EID15           __at(0x6B57);	// @ (0xD6A * 8 + 7)
#define                                 RXF8EID15_bit       _BIT_ACCESS(RXF8EIDH,7)
// RXF8SIDL<RXF8EID16>
extern volatile __bit                   RXF8EID16           __at(0x6B48);	// @ (0xD69 * 8 + 0)
#define                                 RXF8EID16_bit       _BIT_ACCESS(RXF8SIDL,0)
// RXF8SIDL<RXF8EID17>
extern volatile __bit                   RXF8EID17           __at(0x6B49);	// @ (0xD69 * 8 + 1)
#define                                 RXF8EID17_bit       _BIT_ACCESS(RXF8SIDL,1)
// RXF8EIDL<RXF8EID2>
extern volatile __bit                   RXF8EID2            __at(0x6B5A);	// @ (0xD6B * 8 + 2)
#define                                 RXF8EID2_bit        _BIT_ACCESS(RXF8EIDL,2)
// RXF8EIDL<RXF8EID3>
extern volatile __bit                   RXF8EID3            __at(0x6B5B);	// @ (0xD6B * 8 + 3)
#define                                 RXF8EID3_bit        _BIT_ACCESS(RXF8EIDL,3)
// RXF8EIDL<RXF8EID4>
extern volatile __bit                   RXF8EID4            __at(0x6B5C);	// @ (0xD6B * 8 + 4)
#define                                 RXF8EID4_bit        _BIT_ACCESS(RXF8EIDL,4)
// RXF8EIDL<RXF8EID5>
extern volatile __bit                   RXF8EID5            __at(0x6B5D);	// @ (0xD6B * 8 + 5)
#define                                 RXF8EID5_bit        _BIT_ACCESS(RXF8EIDL,5)
// RXF8EIDL<RXF8EID6>
extern volatile __bit                   RXF8EID6            __at(0x6B5E);	// @ (0xD6B * 8 + 6)
#define                                 RXF8EID6_bit        _BIT_ACCESS(RXF8EIDL,6)
// RXF8EIDL<RXF8EID7>
extern volatile __bit                   RXF8EID7            __at(0x6B5F);	// @ (0xD6B * 8 + 7)
#define                                 RXF8EID7_bit        _BIT_ACCESS(RXF8EIDL,7)
// RXF8EIDH<RXF8EID8>
extern volatile __bit                   RXF8EID8            __at(0x6B50);	// @ (0xD6A * 8 + 0)
#define                                 RXF8EID8_bit        _BIT_ACCESS(RXF8EIDH,0)
// RXF8EIDH<RXF8EID9>
extern volatile __bit                   RXF8EID9            __at(0x6B51);	// @ (0xD6A * 8 + 1)
#define                                 RXF8EID9_bit        _BIT_ACCESS(RXF8EIDH,1)
// RXFCON1<RXF8EN>
extern volatile __bit                   RXF8EN              __at(0x6EA8);	// @ (0xDD5 * 8 + 0)
#define                                 RXF8EN_bit          _BIT_ACCESS(RXFCON1,0)
// RXF8SIDL<RXF8EXIDEN>
extern volatile __bit                   RXF8EXIDEN          __at(0x6B4B);	// @ (0xD69 * 8 + 3)
#define                                 RXF8EXIDEN_bit      _BIT_ACCESS(RXF8SIDL,3)
// RXF8SIDL<RXF8SID0>
extern volatile __bit                   RXF8SID0            __at(0x6B4D);	// @ (0xD69 * 8 + 5)
#define                                 RXF8SID0_bit        _BIT_ACCESS(RXF8SIDL,5)
// RXF8SIDL<RXF8SID1>
extern volatile __bit                   RXF8SID1            __at(0x6B4E);	// @ (0xD69 * 8 + 6)
#define                                 RXF8SID1_bit        _BIT_ACCESS(RXF8SIDL,6)
// RXF8SIDH<RXF8SID10>
extern volatile __bit                   RXF8SID10           __at(0x6B47);	// @ (0xD68 * 8 + 7)
#define                                 RXF8SID10_bit       _BIT_ACCESS(RXF8SIDH,7)
// RXF8SIDL<RXF8SID2>
extern volatile __bit                   RXF8SID2            __at(0x6B4F);	// @ (0xD69 * 8 + 7)
